{
  "threads": [
    {
      "thread_title": "Seeking A Cost-effective Debt Collection Litigator in Texas",
      "thread_body": "I'm looking to enforce a contract against a customer, and we're past the point of a debt collection agency. I typically use Foley for my outside counsel needs, but the claim against this customer is lower dollar value so looking for a mid-size firm or smaller. Austin is preferred, but Dallas is also acceptable. Thank you in advance! (In the alternative, the customer is based in Massachusetts, so a referral in that jurisdiction may also be helpful.) "
    },
    {
      "thread_title": "Legal & Compliance Challenges Of Turning On-Prem Customers Into Cloud Users",
      "thread_body": "What strategies have other software companies used to attract on-prem customer to their cloud offerings / to boost the adoption of cloud features by on-prem customers? I would be interested in any recommendations on how to efficiently manage the legal and compliance challenges of turning on-prem customers into cloud users, in particular, when \"cloud add-ons\" are made available to existing on-prem customers who don't yet have cloud terms, data processing agreements, infosec schedules, data transfer clauses, etc., how to palliate those gaps effectively.   * Could \"click-through\" processes executed by IT admins to accept the software vendor's standard terms create enough legal certainty even in cases where those standard terms would significantly alter / override hard-negotiated agreements in place?   * The idea of the business is to make the cloud features available to the customers' IT admins, and have them click through the cloud onboarding process, asking them to represent that they have the legal authority to do so. We as the legal team don't think that this strategy legally bulletproof, but the business doesn't want to introduce \"legal friction\" into the product adoption process.   "
    },
    {
      "thread_title": "Digital Media Anti-Piracy Efforts",
      "thread_body": "I would be interested in discussing anti-piracy efforts by direct-to-consumer digital media companies. If you, or anyone in your network, has experience here and would be willing to speak with me, please reach out and let me know. I'll share what we are doing at FloSports. "
    },
    {
      "thread_title": "Federal Clearance",
      "thread_body": "Our company holds a Facility Clearance (FCL) for prime subcontracting govn't contracts, which of course requires us to designate a Senior Management Official (SMO).  The individual who would serve as SMO is unable to. It also practically does not make sense for that person. I can provide more details.  We've seen exception examples--like Raytheon/RTX, but our DCSA rep is holding firm and not allowing exceptions. Has anyone successfully worked with DCSA on exceptions or appeals? Any advice would be greatly appreciated. Thanks in advance! "
    },
    {
      "thread_title": "Generative AI Playbook",
      "thread_body": "Generative AI Playbook. "
    },
    {
      "thread_title": "AI Workflows",
      "thread_body": "I have been tasked with incorporating AI into the legal workflow (beyond contract redlining). My goal is to create a self-service environment for the business, as I am a department of one. The business is challenged in that it's a \"green\" group when it comes to legal, and I think AI could be really useful in educating and getting the business organized. Is there anyone else working on this type of project? "
    },
    {
      "thread_title": "Legal Contact @ Google, LLC / GTech",
      "thread_body": "If anyone would be willing to share a legal POC at Google, LLC (or their GTech unit if they are that granular), I would greatly appreciate it. My team is running into a business side contact who seems unwilling to raise some pretty market standard contract revisions with their legal team. It seems the biz folks have authority to negotiate commercial points of their standard vendor contract but nothing that is purely legal (e.g. liability, indemnification). Alternatively, if anyone has experience with their willingness to negotiate allocation of risk generally or liability caps specifically, that would be helpful as well. "
    },
    {
      "thread_title": "Fund Counsel For Weirder Stucture",
      "thread_body": "A friend is working on his fund 2 and is thinking about an alternative fund structure for it. Something like a holdco/evergreen model or consulting + GP structure. He's not wedded to any of those, but feels like his current counsel is very \"traditional structure\" focused and can't really help him thinking through all these options.  Does anyone have someone for these more alternative fund structures? "
    },
    {
      "thread_title": "LPOs in Eastern Europe or India?",
      "thread_body": "Looking for recommendations for LPOs located either in Eastern Europe or India. I'd also be curious if anyone is willing to share their experience working with an LPO vs fully automating via AI. Primarily, I'm looking for a company that excels in contract management, but open to other areas as well. "
    },
    {
      "thread_title": "Commercial Litigator In Los Angeles, CA",
      "thread_body": "I am looking for a good, reasonably priced commercial litigator in Los Angeles, CA. Please send through any recommendations. "
    },
    {
      "thread_title": "Contracts 365",
      "thread_body": "I am reaching out to gather insights and experiences from anyone who is currently using Contracts365 as their Contract Lifecycle Management (CLM) system. Our team has been utilizing both Agiloft and Ironclad, but we've encountered a few challenges with these platforms.  If you have experience with Contracts365, I would love to hear about your successes, any pain points you've faced, and overall impressions of the system. "
    },
    {
      "thread_title": "Research Security Training For Fed R&D Grant Applications",
      "thread_body": "There is a new requirement for any covered institution (not just research universities or labs) applying for federal R&D grants, that named applicants complete a \"research security training\", based on federal guidelines. The requirement can be completed by completing the 4 1-hour modules offered by the NSF, found here. Alternatively, applicants can \"develop and implement their own research security training program aligned with the requirements in Section 10634(b) of the CHIPS and Science Act of 2022.\" Question to this group: Has anyone developed their own internal training that would comply with this requirement that they'd be willing to share? "
    },
    {
      "thread_title": "Indonesia Outside Counsel",
      "thread_body": "Does anyone have recommendations for outside counsel in Indonesia? We're looking to manage localization for some terms updates on fairly short notice. "
    },
    {
      "thread_title": "UK Counsel For Late Stage Financing",
      "thread_body": "Looking for UK counsel to assist with an investor-side late stage venture financing into a UK company (we are US based). Preferably a small shop that is responsive. "
    },
    {
      "thread_title": "CO Employment Counsel",
      "thread_body": "Any recommendations for a small-midsize firm to be CO employment counsel? "
    },
    {
      "thread_title": "Internal Regulations Of Order, Hygiene and Safety (“RIOHS”) in Chile",
      "thread_body": "I know this is a major longshot, but has anyone who has an entity in Chile put a RIOHS in place which governs mandatory workplace regulations. My local counsel (Baker) sent me a 140 page RIOHS and it seems superfluous and more suited towards their traditional workforce (mining, ag, manufacturing), as opposed to a tech company. A modified version I proposed is outdated, so I'm wondering if anyone has a recent RIOHS that I can look at and compare to my version.  My expectations that anyone has a template are pretty low, but figured I would ask. "
    },
    {
      "thread_title": "FP&A Software Recommendations",
      "thread_body": "My finance / accounting team is vetting FP&A software for a Microsoft-based shop in the manufacturing industry. Although this isn't legal focused, does anyone have any recommendations for FP&A software (perhaps you have heard how much your finance / accounting team loves a particular solution)? Bonus points if it integrates well with a manufacturing operation. "
    },
    {
      "thread_title": "Job Description For An Infosec Role?",
      "thread_body": "We are considering bringing on an individual who specializes in information security/privacy to handle communications with customers around our security processes and so on, and respond to security questionnaires in a way that expresses our positions in a way that is true to our infrastructure but also in \"legalese.\"      Notable, this would not be a lawyer/counsel role, but would roll up to legal. I'm trying to find an example of a similar role or job description we can use to move forward. "
    },
    {
      "thread_title": "Feedback On Insurance Broker - CAC Group",
      "thread_body": "Anyone here has any experience with CAC Group as their primary insurance broker? "
    },
    {
      "thread_title": "Ohio Regional Income Tax Agency (RITA)",
      "thread_body": "Have others with employees in Ohio received \"unpaid municipal income tax balance\" notices from Ohio Regional Income Tax Agency (RITA)? We're trying to evaluate if this is a scam or legitimate. The paper notice we received feels less than legitimate. "
    },
    {
      "thread_title": "Referral To Outside Counsel For AZ State Procurement Matter",
      "thread_body": "Thanks for any referrals for an attorney who can advise a software company on a contract termination by an agency of the state of Arizona. I'll provide all referrals to the company and they'll follow up as they determine. "
    },
    {
      "thread_title": "Recruiter In SF",
      "thread_body": "I'd appreciate recommendations for a recruiter in San Francisco who can help with our search for a senior commercial counsel in the tech/cybersecurity space. Thanks in advance. "
    },
    {
      "thread_title": "Offshore Contracts And Operations",
      "thread_body": "I'm looking for ways to reduce our spend and considering offshore resources for commercial contracts and for legal operations. Has anyone found a company that offers these services. Also, a long those lines what should I consider when thinking of the timing and maturity (readiness) of the company? "
    },
    {
      "thread_title": "Carta API",
      "thread_body": "Has anyone had any luck getting an API key from Carta? We've asked several times (for over a year), and haven't received one from them.   For context in case anyone has other ideas, we have a parent company and multiple subsidiaries where an employee can receive options at both levels. I need a way to quickly know where and how much equity an employee has across subs. Right now, I need to go into each Carta account and do a search of that employee. With the Carta API, I should be able to build something where I can lookup an employee and have it return their equity across all entities, but I can't figure out how to do it without an API. "
    },
    {
      "thread_title": "ChatGPT Enterprise / Perplexity Pro – Curious if Anyone Has Negotiated the Agreement",
      "thread_body": "For those of you using ChatGPT Enterprise or Perplexity Pro, I'm curious--did you negotiate the agreement, or just take it off the shelf? "
    },
    {
      "thread_title": "Grant Funding",
      "thread_body": "I'm interested to know if anyone has experience researching government grants or grant funding from charities primarily for UK, US and/or Swiss companies? I'm particularly interested in what is available for biotech companies, but any knowledge sharing in any of these jurisdictions would be helpful. I am wondering whether there are any sources that might list the available funding as the information seems very piecemeal to me at the moment! Thanks in advance for your insights. "
    },
    {
      "thread_title": "UX/Legal Presentation",
      "thread_body": "Following the UX CLE yesterday, does anyone have a presentation on UX issues for the product team (dark patterns, cancellation, etc.)? Would love a starting point. "
    },
    {
      "thread_title": "Patent Attorney To Review Possible Infringement Of Issued Patent",
      "thread_body": "I'm looking for a patent attorney to help me review a possible infringement matter as it relates to one of our company's issued patents. Looking for someone who is practical and will help identify any blindspots and weaknesses in what I'm seeing with my untrained eyes. "
    },
    {
      "thread_title": "New Zealand Attorney For Debt Collection/Liquidation Questions",
      "thread_body": "I need an attorney in New Zealand that can help me with collecting a debt or securing a lien on inventory with one of our distributors. Any recommendations? "
    },
    {
      "thread_title": "OSINT Services",
      "thread_body": "We are looking at OSINT services with a focus on corporate ownership, investment and relationships in China. Currently, we are specifically looking at WireScreen.ai, and would appreciate any recommendations or insights anyone might have. "
    },
    {
      "thread_title": "Outsourced SaaS Commercial Contracting Recommendation",
      "thread_body": "I'm looking for outsourced US commercial contract support for SaaS/software agreements, experienced in:   * engaging with in-house business   * negotiating and riving to close   * familiar with data privacy and AI terms   Do you have individual, Lawtrades/Axiom or fractional GC recommendations (like Outside GC)? Exploring all, and grateful for intros to people. "
    },
    {
      "thread_title": "Operating In Lithuania?",
      "thread_body": "Does anyone have experience with operating in Lithuania? We have a small development team located there that we inherited through acquisition and would appreciate some perspective from others who have operated in country.  "
    },
    {
      "thread_title": "Giving Out 409a",
      "thread_body": "Whats's people's position on giving out your 409a to investors who don't have entrenched information rights? "
    },
    {
      "thread_title": "Experience With Enforcement Of Judgements In China",
      "thread_body": "I would love to chat with anyone who has successfully enforced a judgment for damages in China. We have obtained a favorable judgement from the competent Chinese court for damages in a patent litigation dispute but have been unable to enforce the judgement. It seems that the defendant has shut down the company and opened a new company with a different name at a different location to avoid paying damages and continues to infringe our patents. Curious to hear if anyone has faced similar challenges in China and has been able to overcome it. "
    },
    {
      "thread_title": "Collections Defense In The UK",
      "thread_body": "Hoping that someone in the braintrust can help. We need to hire local UK (London) counsel to potentially defend against a collections matter. In fact, it's highly likely we would file a counter-claim for malicious prosecution. Any recommendations for a firm that can handle this would be greatly appreciated. Kudos if it is a small firm, as the matter in question is also very small. "
    },
    {
      "thread_title": "Management Company Ownership, GP Fund Commits",
      "thread_body": "In connection with some internal reorganization, a couple of questions recently came up from our GPs about what other funds are doing:   * Who owns the management company at your fund -- all of the GPs collectively, or some subset of them (and if a subset, how is it determined)? Currently only two of our GPs own the management company, and we're considering changing that.         * What % of the capital commit are you seeing the GPs typically being responsible for in recent fundraises? (We used to do 5%, and at our last fundraise we stepped that down to 3%, but we're considering going even lower for the next fund.)   "
    },
    {
      "thread_title": "Israeli Securities Law Counsel",
      "thread_body": "Does anyone have a recommendation for Isreali securities law counsel? "
    },
    {
      "thread_title": "ContractpodAI",
      "thread_body": "Does anyone have recent experiences with ContractpodAI to share? In particular around Leah/AI. Some of the threads on this are older and the tech changes quickly. Thanks!  "
    },
    {
      "thread_title": "B2B Sales Team Compensation Consultants",
      "thread_body": "I'm currently seeking a highly experienced consultant who specializes in designing and optimizing compensation plans for B2B sales teams. We're aiming to ensure our incentive structures drive performance, align with business goals, and attract top sales talent. If you've worked with or know a trusted expert in sales compensation strategy--especially someone familiar with B2B sales environments--I'd greatly appreciate your referrals.      Thank you in advance for your recommendations! "
    },
    {
      "thread_title": "Counsel for Brazilian Equity Grants",
      "thread_body": "I'd welcome recommendations for English-speaking counsel who have advised on making equity grants in Brazil. "
    },
    {
      "thread_title": "Streamlining Complex Beta Programs at a SaaS Company",
      "thread_body": "I'm looking for insights on how other teams manage and streamline beta programs, especially in complex SaaS environments. We're a SaaS company that often runs multiple beta programs at once, led by different cross-functional teams. One of our key requirements is that customers must accept our beta terms before participating. This is straightforward for those on our online terms of service, but historically, we didn't embed beta terms into our MSA -- which has led to a lot of manual work. Right now, it's operationally burdensome to track who has accepted the beta terms, since ownership varies by team and there's no standardized intake or tracking process. As our customer base grows, it's becoming increasingly difficult to maintain consistency and compliance.   How did you streamline customer opt-ins and legal acceptance across beta programs?   Did you centralize intake or automate verification?   Any tools, processes, or organizational models that worked well?      Would appreciate any tips or lessons learned. Thanks in advance!   Bhawana "
    },
    {
      "thread_title": "Bay Are small/mid-size firm that negotiate PE?venture/investment agreements?",
      "thread_body": "I'm looking for a recommendation for a good small/mid-sized Bay Area firm to jump in on a negotiation for PE/Venture/Inventment agreements. Any leads much appreciated! "
    },
    {
      "thread_title": "Startup Lawyer In Australia?",
      "thread_body": "Can anyone recommend a scrappy, pragmatic, business-minded lawyer or firm in Australia to help us operationalize a new subsidiary there? We're going to need basic support for things like standard forms, basic corporate secretary/governance advice, occasional employment matters, ideally (but nice to have) also competent in commercial contracts and other items such as real estate and construction.      It's a lot, I know, but I thought I'd throw out the full wish list! I'm mostly focused on the \"scrappy, pragmatic, business-minded lawyer\" part and if I need to pull together a panel of folks from one or more firms, no big deal. "
    },
    {
      "thread_title": "Switching From MSA To Order Forms",
      "thread_body": "Our company currently still uses long-form MSAs for commercial contracting. This is causing some friction in the sales cycle, and I think somewhat unnecessary reviews and and redlines by prospects. I am putting together a strategy for moving to an Order Form + online T&Cs format. Has anyone here done something similar for their business? If so, I'm looking for any data (even if just anecdotal) on the impact this may have had, e.g. fewer contracts requiring negotiation / legal review, reduced negotiation cycle by x% etc. The business sells access to carbon market data via a SaaS-type platform, with some pro-serv. "
    },
    {
      "thread_title": "Commercial Litigation Lawyer In Ireland",
      "thread_body": "I have a potential medium-sized dispute in Ireland and would love a recommendation for a reasonably priced commercial litigator. Would be good if the lawyer can be fairly aggressive. The other party will need a serious reality check. "
    },
    {
      "thread_title": "Executive Coaching For Senior In-House Legal Leaders",
      "thread_body": "Curious if anyone has solid executive coach recommendations for senior in-house legal leaders. I'm exploring the option to bring one on in some capacity for our CLO and her directs. Coaching - and what to look for in a coach - is a bit of a blind spot for me, so appreciate any recommendations! "
    },
    {
      "thread_title": "Washington State Employment Counsel (Employee Side)",
      "thread_body": "I am looking for some recommendations for an employee-side employment counsel in Washington State who could help a senior employee at a large technology company with some conduct that appears to be age-related discrimination. This would be a pay-out-of-pocket situation so appreciate recommendations for skilled attorneys who might also be somewhat cost effective. "
    },
    {
      "thread_title": "Canadian Resident Director",
      "thread_body": "We need to engage an independent Canadian resident director for our two Canadian subsidiaries. If anyone has any recommendations for vendors that provide this service it would be greatly appreciated. Thank you. "
    },
    {
      "thread_title": "Collections Agency In Phoenix AZ?",
      "thread_body": "I have a simple breach of contract claim I'd like to file in AZ but it is only a few thousand dollars, and the defendant has a couple of default judgments against him already. Any suggestions for collections? "
    },
    {
      "thread_title": "Insurance - Anti Rebate Laws",
      "thread_body": "Hi, any chance you have an overview or some kind of table summarizing the US anti rebate laws? "
    },
    {
      "thread_title": "Matter Tracking/Management",
      "thread_body": "Curious as to what people are using to track matters internally. We have SimpleLegal for eBilling but find it does not have the matter management capabilities and workflows/task management that is needed, so we have developed a centralized Smartsheet with dynamic views and automation for customer disputes, litigations, employment claims, and other HR/customer matters. It is working OK, but think we are nearing a point where we need to look for a more robust curated solution. Would love any recommendations! "
    },
    {
      "thread_title": "ISO A Civil Rights Attorney In MA",
      "thread_body": "Hi, all. My colleague is looking for a civil rights attorney, ideally admitted in Massachusetts. I would appreciate any referrals. Thanks! "
    },
    {
      "thread_title": "Litigation/Settlement Authority Guidelines",
      "thread_body": "Hello all - I'm new to the LSuite and thrilled to be here with all of you. Does anyone have a policy or guardrails re: settlement authority as the GC they are willing to share. "
    },
    {
      "thread_title": "Cost Effective SLED Counsel",
      "thread_body": "We need some assistance with both the NASPO and TX-DIR contracts (working through a reseller/prime) and to round things out, a direct contract with the State of Oregon--because sales didn't tell us they bid direct and of course, we won the bid.         If anyone has cost-effective SLED counsel they have worked with in the past, I would appreciate the recommendation! "
    },
    {
      "thread_title": "Negotiating With Microsoft (Hosting on Zzure/Listing on marketplace)",
      "thread_body": "Does anyone here have experience working with Microsoft on listing in their marketplace and would any of you be willing to chat with me about some of the levers they will negotiate across the different touch points with them. We are also a large Microsoft enterprise customer and so far we've been working on all of those things separately. My spidey sense is that we should be looking at this holistically and leveraging our existing spend to get more favorable hosting/marketplace terms (like a lower threshold to hit MACC, for example). "
    },
    {
      "thread_title": "Org Charts",
      "thread_body": "Very basic question but does anyone have an app or something they've liked using for putting together org charts? Currently just use PPT but thought I'd check if anything better out there. Thanks! "
    },
    {
      "thread_title": "TCPA Counsel",
      "thread_body": "Hi all. Does anyone have experience with any of the below firms for TCPA disputes?   * Cozen O'Connor   * Gordon Rees   * O'Hagan & Meyer   If yes, we appreciate any thoughts you're willing to share! "
    },
    {
      "thread_title": "Lobbyist In Portugal",
      "thread_body": "I am in need of a lobbyist (or the equivalent) in Portugal to help resolve a thorny telecommunications issue with ANACOM, the Portuguese telecommunications regulator. Any lobbyist recommendations would be great, even if the person is not telecommunications focused. "
    },
    {
      "thread_title": "Looking For An Inexpensive Commercial/Investments Lawyer (Small Firm/Solo) Based In Los Angeles",
      "thread_body": "I am looking for leads on an inexpensive commercial lawyer in Los Angeles. This is to help structure a simple investment into a startup, with some weird commercial quirks (equity to vest based on hitting various milestones relating to business origination and revenue). Thanks! "
    },
    {
      "thread_title": "Israeli Consumer Class Action?",
      "thread_body": "I'd be grateful to connect with anyone who has experience litigating consumer class action in Israel (in particular looking for referrals/recommendations on firms, but would also love the chance to connect live to ask a few questions). "
    },
    {
      "thread_title": "Calibrating Patent Investments",
      "thread_body": "How do your teams decide what verticals to file patents in? My IPMS (ArcPrime) is recommending addressable market and litigation and has told me these are the most common ones. Looking for a gut check here. "
    },
    {
      "thread_title": "Offsite Icebreakers",
      "thread_body": "I'm going to be running an icebreaker session for a large management team (the team under our exec team) and wondered if anyone had any useful exercises they'd used or seen in these sessions? Looking for it to be creative, not too corporate, but actually useful in terms of driving some business outcome despite it being an opening session. Oh, and fun! "
    },
    {
      "thread_title": "Incorporating Agent/Accounting In Namibia",
      "thread_body": "Anyone have recommendations for local accounts, law firms, or other agents who can support with setting up a subsidiary in Namibia? If so, please send my way! "
    },
    {
      "thread_title": "US Export Compliance",
      "thread_body": "I'm looking to connect with someone from a small to midsize tech company that deals in export controlled hardware and related services who would be willing to share insights into how your team handles day-to-day operations related to export compliance under ITAR and EAR. Thank you! "
    },
    {
      "thread_title": "RFP for E-Discovery Vendor",
      "thread_body": "Does anyone have a sample RFP template they have used for a Managed Services e-discovery vendor? We're looking for an end-to-end provider in the US. "
    },
    {
      "thread_title": "Lightweight Sanctions Screening Tool",
      "thread_body": "Consumer-facing company looking for a cost-effective, lightweight sanctions screening tool to use for all of the vendors who provide services to us (i.e., not such a heavy user as a SaaS company).  Our business is in US, Canada, UK and Western Europe.  I have heard good things about CSI Watchdog and would love feedback from any users, as well as any other recommendations. "
    },
    {
      "thread_title": "Deportation Defense Legal Expenses",
      "thread_body": "As an adjunct to our employee immigration support policy, we're considering offering employees some financial support for their legal counsel if they or an immediate family member is facing imminent deportation. Have any any of your companies considered or established such a benefits policy? Do you have any advice (or a sample policy) you would share with me, please? Thank you. "
    },
    {
      "thread_title": "Product Counsel Phone Software And Hardware",
      "thread_body": "I'm looking for product counsel recommendations with strong technical experience in phone hardware and software, with contracting experience if possible. Law firms recommendations and individual product counselors are both great. "
    },
    {
      "thread_title": "Marcus Evans Trainings",
      "thread_body": "Does anyone have experience with the training events from Marcus Evans Group? I received an invitation for their November Legal Operations Excellence: Elevate Your Department, Empower Your Career event, but have never heard of them. Thank you! "
    },
    {
      "thread_title": "Trust & Estate Referral – Tampa area",
      "thread_body": "Looking for a trust and estate lawyer in the Tampa / St. Pete / Clearwater area. If you have a solid recommendation, please lmk. Thanks! "
    },
    {
      "thread_title": "Software Provider Demanding Declaration Of Compliance",
      "thread_body": "We received some aggressive messages from a software provider alleging that we are using several unlicensed copies of their software (we purchase 2 copies). Our IT team investigated and found no unlicensed copies. The software provider is refusing to provide any evidence to substantiate their allegation, and is now demanding a sweeping declaration from us that there are no breach of the licensing agreement and if a breach is subsequently found, we will be fully responsible etc. There is no obligation under the software agreement/EULA to provide such a declaration. My inclination is to provide a declaration that is far less sweeping, just stating the investigation that was carried out and the result. If anyone has experience in this area, I would be grateful for your thoughts. "
    },
    {
      "thread_title": "Downtime in SaaS Contract SLAs",
      "thread_body": "I was interested to hear how others define the concept of downtime in any uptime commitments you make for a SaaS platform. Do you make a distinction between the platform being completely down versus degraded or partially down or is that all considered \"downtime\" in the same way.  If you do distinguish do the service level commitments for these things differ? "
    },
    {
      "thread_title": "AI / AGI And Force Majeure",
      "thread_body": "Has anyone begun incorporating AI or AGI related terms into their force majeure clauses? For example, has anyone begun carving out AI failures from force majeure events or carving out \"the development of AGI\" from their force majeure events. Broadly responsive answers to this questions are also welcome, as are examples. "
    },
    {
      "thread_title": "ISO42001",
      "thread_body": "Has anyone gone ahead and already got ISO42001 status? If so please DM me as i would love to discuss your experience further. "
    },
    {
      "thread_title": "Amazon Provider Agreement",
      "thread_body": "Has anyone tried negotiating Amazon's standard Provider Agreement? They told us it's \"non-negotiable\" but some of the IP terms are problematic for us. Any advice on attempting to negotiate this type of agreement with Amazon would be much appreciated. Thanks! "
    },
    {
      "thread_title": "Torus Ventures LLC NPE/Patent Troll",
      "thread_body": "Is anyone familiar with the NPE/paten troll Torus Ventures LLC? It looks like they've been active in the Eastern District of Texas with one patent recently.  "
    },
    {
      "thread_title": "UK Insolvency",
      "thread_body": "Does anyone have a good recommendation for counsel who can assist with recouping funds from a UK vendor that has become insolvent and is undergoing a creditors voluntary insolvency? We're a Massachusetts-based company. "
    },
    {
      "thread_title": "Privacy Compliance Consultant",
      "thread_body": "I oversee privacy compliance in our consumer-facing sports streaming business. As the pace of adoption of new privacy legislation, particularly concerning childrens' data, accelerates, I am considering seeking outside help to thoroughly audit our operations for compliance and risk. I am concerned that using a law firm for this purpose may be inefficient. Has anyone engaged a privacy consultant for this use case and been happy with the result? Any recommendations? Thanks! "
    },
    {
      "thread_title": "Self-Funded / Level Funded Insurance Program",
      "thread_body": "Has anyone here transitioned from a fully insured to a level-funded or self-funded insurance program. Looking for some context on the administrative burden of these switches and wonder if anyone can share about their transition. "
    },
    {
      "thread_title": "Has Anyone Used Hyperstart CLM?",
      "thread_body": "I came across a contract lifecycle management tool called Hyperstart CLM, and I was curious if anyone here has experience with it. I'm interested in hearing your thoughts on whether you've evaluated it, used it in your org, or decided against it for any reason. Any feedback on its usability, features, or how it compares to other CLM solutions would be really appreciated! "
    },
    {
      "thread_title": "Interest Check:  Monthly/Bi-Monthly AI In Legal Departments Roundtable",
      "thread_body": "Hello, I'm reaching out to see if there's interest in forming a monthly or bi-monthly group to discuss AI integration. Our Chief Legal Officer is really encouraging us to explore AI, and we've been experimenting with various vendors and tools.  Lately we're focusing on Gemini & Notebook LM but also open to hear what AI tools other legal departments are leveraging.   I'd love to connect with others to share AI use cases, experiences, challenges, and best practices. "
    },
    {
      "thread_title": "Employee Immigration Concerns",
      "thread_body": "Is anyone navigating concerns from employees around civil unrest/ ICE/ immigration concerns. I'm specifically referring to employees that are either green card holders or on a visa sponsorship. Welcome any information you can share on how you're navigating conversations with them, providing accommodations, etc. "
    },
    {
      "thread_title": "Skip Tracing East Cost",
      "thread_body": "A friend is divorcing her husband who lived in the NYC Metro area for many years, was last seen in North Carolina and is incognito moving north. She needs to serve him divorce papers. Anyone have a good skip tracing company to track him down? Not making this up! "
    },
    {
      "thread_title": "Employee Peer-Led Groups",
      "thread_body": "Our employee engagement team is looking to establish employee-led interest groups for employees to come together to share in joint interests (think movie lovers, fitness enthusiasts, etc.) outside of the pressure and/or expectations of leadership. Has anyone in the Braintrust been involved in standing something like this up and would be willing to connect briefly? Bonus points if you have a policy document that you would be willing to share on this. "
    },
    {
      "thread_title": "California Software Licensing Program (SLP)",
      "thread_body": "Does anyone have experience contracting with the state of California under their SLP program? For background, we are trying to enter into a relationship with the State, but the terms they are requiring are completely unacceptable to us. As such, we are wondering if there is any way to go through a reseller (eg, Carahsoft) to somehow insulate us from some of the worst of these terms. "
    },
    {
      "thread_title": "Ironclad",
      "thread_body": "Anyone want to share their experiences with Ironclad and/or have a good contact there. "
    },
    {
      "thread_title": "ChatGPT Access To Google Drive",
      "thread_body": "Has anyone here gone through analysis and permitted use of the ChatGPT Teams integration w/ Google Drive (where ChatGPT gets unlimited access to Google Drive)? Would love to read or hear the details of the analysis. "
    },
    {
      "thread_title": "Litigation Management",
      "thread_body": "Any recommendations for a litigation management tool? "
    },
    {
      "thread_title": "Referral To Healthcare Services Lawyer, Ideally In Oregon",
      "thread_body": "Can you recommend a good healthcare services/regulatory lawyer, ideally in OR? A friend who runs a successful medical services business needs advice complying with the federal Stark Law, as well as any related Oregon laws. "
    },
    {
      "thread_title": "Has Anyone Used Fulcrum GT Or Apperio For E-Billing/Spend Management?",
      "thread_body": "We know the usual suspects when it comes to ebilling tools, but I'm curious if anyone has used Apperio (now owned by Persuit) or Fulcrum? They've both been around a while but I've never actually met anyone who uses them! If you do, I'd love to hear about your experience! "
    },
    {
      "thread_title": "Outside Counsel Management",
      "thread_body": "I'm looking to connect with folks who have deep experience in outside counsel management, especially those who: Manage timekeeper rates at the matter level   Have hands-on expertise with SimpleLegal, an Onit company   Are navigating or refining panel management processes If this is your world, I'd love to learn from you. My team is working on evolving our approach at Zoom and would really value your insights--what's worked, what hasn't, and where you see opportunities for smarter approaches. "
    },
    {
      "thread_title": "Auditor Recommendation",
      "thread_body": "I work at a late stage SaaS company based in NY with significant operating subs in Japan and rest of Asia.  I'd appreciate receiving any referral/recommendation regarding audit firms - ideally cost effective (!) firms who have handled going public and ongoing pubco work streams (PCAOB audit). "
    },
    {
      "thread_title": "Recommendation For Canadian Financing Counsel",
      "thread_body": "I'm looking for a recommendation for a Canadian counsel who can assist with financing document and security document review who will be startup friendly and below the price range of the top Canadian firms (Blakes, Osler, etc). Need to instruct someone fairly quickly. Any suggestions welcome! "
    },
    {
      "thread_title": "Best Practices For Retention Policies",
      "thread_body": "I'm working on updating my company's retention policies. Would appreciate if members of the community could share best practices for a clear and effective retention policy. I primarily have two questions:    * Is it better to have one universal policy or multiple policies for different types of data (i.e. one for employees, one for user data, etc.,)?   * When organizing the various retention periods for data obtained from the user what is best practice? Is it better to break-down the individual pieces of data we collect or should the schedule be organized by feature sets?   Any additional suggestions/guidance you have is welcome. Thank you in advance. "
    },
    {
      "thread_title": "Colorado Defamation Counsel",
      "thread_body": "Any recommendations for a Colorado lawyer for a defamation case? Cost-conscious options will be very much welcomed. "
    },
    {
      "thread_title": "Recommendation For RIA-Focused Securities Lawyer",
      "thread_body": "Hi All - I am looking to retain an RIA-focused securities lawyer to help us with some regulatory work related to an AI Roboadvisor we are building. I would prefer someone at a smaller, mid-sized, or boutique firm, as we've received guidance from our Corp/Reg lawyers Wilson that we found a bit academic (borderline flippant, essentially saying this is a new space and we should feel empowered to do whatever we want given the current regulatory climate) and lacking in practical guidance (e.g., not a lot of detail on what risks can be mitigated by disclosures vs back end controls). I am now sourcing a second opinion as I conduct my own gap analysis/compliance risk assessment. Any referrals are much appreciated! "
    },
    {
      "thread_title": "Exec Table Top Exercise Templates",
      "thread_body": "Does anyone have any templates or examples of exec level table top exercises they would be willing to share? Or any details on how you might have put one together would be greatly appreciated. We've run several cybersecurity table tops, relying on outside counsel, which seems to be the most common tabletop. Those exercises were very well received and I'd like to expand to other risk related scenarios (e.g. sudden unexpected Trump administration actions jeopardizing key aspects of our business) without a substantial outside counsel cost. Thanks all! "
    },
    {
      "thread_title": "Mass Arbitrations",
      "thread_body": "Does anyone have a recommendation for counsel to help revise an arb clause with the \"latest and greatest\" in mass arb provisions/mitigants? Welcome any recommendations.  Bonus question: What arb platform do folks prefer for defending mass arbs? Particularly in terms of fee structure - which seems to be (maybe intentionally) opaque in all of their publicly available info. "
    },
    {
      "thread_title": "Pre-Employment Background And Criminal Records Checks",
      "thread_body": "We're revisiting our pre-employment screening processes, and I'm interested to know what approaches others are taking with regarding to comprehensive pre-employment background checks, and criminal records checks specifically (and particularly if you are at an organization that is ISO or SOC2 certified). Do you perform criminal records checks as part of the pre-employment screening process? If so, is it for all potential employees or only a subset, and if a subset, how have you defined or categorized that subset? Many thanks for all input, and happy to connect 1:1 offline if that's best. "
    },
    {
      "thread_title": "DORA-Related Customer Requests",
      "thread_body": "This is a question for IT services provider with customers who are subject to DORA.  Are you seeing (and have seen) a lot of DORA requests since the regulation came into force. We had a surge just shortly before the effective date in mid January but since then it was just a trickle (*knock on wood*). Honestly, I was expecting a lot more of requests for DORA related documentation/provisions. Is this something that you see on your end, too? "
    },
    {
      "thread_title": "A Few Question On OS Practices",
      "thread_body": "Was nice to meet a few of you at the L Suite AI Conference. We evaluate our OS practices annually and in connection with this year's review process, I have a few questions to see where the market's at. Would love to get details about whether others have:      \\- A dedicated open source (OS) policy   \\- A scanning tool, and if so, which one (Snyk, JFrog, GitHub dependency review, etc.)   \\- A formal process in place for the approval of all new, non pre-approved licenses   \\- An up-to-date inventory of their dependencies and associated licenses (SBOM-type), easily exportable and in a readable format for due diligence or when requested by clients      Any answer is helpful. If you feel more comfortable sharing privately, please go ahead. Thanks to all in advance. "
    },
    {
      "thread_title": "ServiceNow - Contract Management Pro",
      "thread_body": "Curious if anyone is using the Contracts Management Pro module within ServiceNow, and what your experience has been? Would LOVE to chat with you about! Feel free to reach out directly. "
    },
    {
      "thread_title": "Reverse Solicitation Exception In Global Jurisdictions",
      "thread_body": "Is anyone aware of any research or information out there about which jurisdictions take a stricter or more lenient view on the \"reverse solicitation\" exception to securities registration requirements? My research so far has found very different reverse solicitation exception conditions in different jurisdictions but I wonder if anyone has found a shortcut to doing this analysis country-by-country. "
    },
    {
      "thread_title": "State Privacy Program For B2B Fintechs",
      "thread_body": "I'd love to connect with anyone who leads a B2B fintech (not consumers) and is implementing state privacy laws. If this is you and you're willing to spend a few minutes on the phone brainstorming on particular nuances, I'd be happy to return the favor anytime. As 25+ year privacy practitioner, there is so much missing or conflicting in the various laws that has me continually shaking my head. "
    },
    {
      "thread_title": "AI Training And War Stories",
      "thread_body": "If you have any war stories you've used to show clients examples of times AI should not have been used - e.g., news stories where pricing or customer data was put into a tool and became public, or where trade secrets were lost, etc. - I'd love to hear some examples in order to build an internal training. We'll also talk about places AI has helped speed things up, but want to give some examples lest anyone not consider the risk. "
    },
    {
      "thread_title": "Singapore IT Managed Service Provider (MSP)",
      "thread_body": "Looking for any recommendations for an IT MSP in Singapore - preferably one with significant experience with Macs over PCs. "
    },
    {
      "thread_title": "Trust And Safety",
      "thread_body": "Does anyone have a Trust and Safety team? If so, anyone in healthcare (bonus points if health care provider) have a Trust and Safety team? Does it report up through Legal/Compliance or elsewhere? Thank you! "
    },
    {
      "thread_title": "Looking For France-Based Counsel — Tax/Employment/Commercial",
      "thread_body": "We're evaluating an expansion into France (Paris) to staff a growing team of software developers. I'm looking for recommendations for a high-quality local firm or France practice group that can help us:   * Navigate available tax incentives for tech/R&D   * Advise on employment law and setting up compliant local hires   * Guide us through general market entry/commercial/regulatory issues   Ideal fit would be a tech-savvy firm comfortable working with U.S.-based in-house teams at growth-stage companies. Bonus if they have experience with SaaS or hybrid software/hardware models. Appreciate any leads -- thanks in advance! "
    },
    {
      "thread_title": "Read.ai",
      "thread_body": "Hello- I checked the Discussions and couldn't find anything on Read.ai. Does anyone have a contact there or can otherwise help with getting Read.ai to disconnect from our company systems? Things I have tried: 1) letting them know they are not an authorized vendor and are not allowed to access our systems (they said that was between them and the user) 2) asking for a list of the users so that I can reach out to the users individually (they said that was against their privacy policy). Any suggestions on how to get this vendor off of our systems would be very much appreciated! "
    },
    {
      "thread_title": "Vietnamese (HCMC) Labor & Employment Counsel",
      "thread_body": "I am looking for local counsel in Vietnam (Ho Chi Minh City specifically), to assist with labor and employment matters. I would appreciate any and all recommendations or advice!  "
    },
    {
      "thread_title": "Reseller Program",
      "thread_body": "We are looking to revamp our SaaS reseller partner program and hoping to get some support from external counsel. Any recommendations? "
    },
    {
      "thread_title": "Request for Recommendations – Legal Outsourcing Provider for Procurement Support",
      "thread_body": "We're currently exploring options to outsource some of our lower-level procurement contract review work and are looking for reputable legal service providers with experience in this area. I wanted to reach out to see if anyone had have any recommendations based on their experience or network.      Ideally, we're looking for a provider that offers: \\- Strong expertise in procurement and vendor contracts   \\- Scalable support (for both ad hoc and ongoing work)   \\- Reliable turnaround times and cost-efficiency   \\- A good understanding of regulatory and compliance frameworks      If you've worked with any vendors you'd recommend--or have heard good things about--I'd really appreciate any input. "
    },
    {
      "thread_title": "CISO",
      "thread_body": "Anyone looking for a fantastic and seasoned CISO? I know an incredible security professional who is looking for a remote position. Based in EMEA. Send me a PM if you would like more info. Happy to make an introduction. This CISO is looking for a role in an engineering and technology lead organisation who understands that infosec is a holistic discipline and for a company who understands that security is a context-sensitive engineering domain. They are strong in technology, and exceptional in applying it to information security. More than 30 years of infosec. 25+ years of systems engineering, 20+ years of hands-on development. 15+ years of technical engineering leadership and a decade of streamlining compliance. Experience covers multiple domains and disciplines. From logistics and security appliances, to high-end embedded systems, to always-online (24/7) B2C distributed systems, to real-time trading and financial services. They have built products and teams; sanitized, modernized and simplified. policies; improved hiring; overhauled development practices; managed, developed and overseen security programs; faced off with regulators; improved company standards to clear audits with ease; and ensured that contracts can be honoured. All the while making sure that engineering   and business can both keep going. "
    },
    {
      "thread_title": "Sale Of SaaS Into China",
      "thread_body": "Has anyone navigated offering SaaS into China with only an outside presence? Have you developed a policy or framework to manage and track the associated regulatory, export control, or data localization risks, or a checklist to go through to approve deals? I would greatly appreciate any precedents. "
    },
    {
      "thread_title": "CLM",
      "thread_body": "Has anyone used DocuSign IAM as their CLM solution? Would love to know more about your experience from demo to implementation and beyond! "
    },
    {
      "thread_title": "Product/Legal Guidelines",
      "thread_body": "I'm searching for practical policy or procedures that outline Product and Legal engagement protocols for  significant changes/new product development, especially in the financial services sector. We have a product team not used to financial services topics, and a legal team not used to signing off on cross-border implications in product. I'm looking for advice on practical approaches from those of you who have built successful operations. There are so many ways to do this - if you're particularly happy with your approach, I'd appreciate learning. "
    },
    {
      "thread_title": "Experience With CLM Vendors",
      "thread_body": "We are currently looking at the following five CLM Vendors. I am looking for feedback on the implementation and overall ongoing experience from the group. Thank you. Onit   Icertis   DocuSign   Ironclad   Agiloft "
    },
    {
      "thread_title": "Attorney Recommendation Seeking for Car Rental Business",
      "thread_body": "Hi, a friend of mine is starting a car rental business and needs to enter into an agreement with third parties who will be helping managing cars. Would appreciate your recommendation for someone who's experienced in reviewing/negotiating this/similar types of operation agreements. Thanks in advanced! "
    },
    {
      "thread_title": "Interactions with Nicholas A. Tiger, Esquire (Virginia)",
      "thread_body": "Please private message me if you have interacted with an attorney named Nicholas A. Tiger, who I believe is from Virginia. He might be a consumer protection attorney. "
    },
    {
      "thread_title": "Wondering What People Think About Claude Code (And Other AI Coding Tools) Not Providing Filters For Public Code",
      "thread_body": "Our org has been using Copilot for a while, which offers a filter to remove public (open source) code from any output. They also provide an indemnity if customers use the filter. Some of the new and (I'm told) improved tools, like Anthropic's Claude Code, don't have a filter and don't seem to make any guarantees about not training on public code.        How are people balancing the needs of their engineering teams against IP and M&A concerns? An infringement lawsuit seems pretty unlikely to me, but I can see having to play a lot of defense and make extra concessions during a diligence process.      I was thinking of trying to deploy a third party tool to scan for license conflicts, however that's pricey and I'm not sure how effective they are in catching code stolen from a copyleft library (as opposed to detecting an entire library). "
    },
    {
      "thread_title": "Attorney Recommendation Seattle Area",
      "thread_body": "Hi all, A friend was in a minor fender bender last fall. The other party is now claiming to have all kinds of injuries. My friend's insurance company is dealing with the other party, but she'd also like her own representation. Can anyone recommend a Seattle-area firm/attorney to advise her? "
    },
    {
      "thread_title": "California Registered In-House Counsel",
      "thread_body": "If any Ops folks have assisted your attorneys with the CA Registered In-House Counsel process, can you send me a chat? "
    },
    {
      "thread_title": "Request For Roles & Responsibilities Related To Legal Claims",
      "thread_body": "My team is currently working on a proposal with multiple options for roles and responsibility clarification and we'd like to include references to similar work done by established and admired companies. The following outlines some of the areas being discussed. Favor: Are you willing to share the team(s) or business owner(s) responsible for the following at your company?   * Liens, Levies, Releases: These pertain to legal claims or seizures against merchant assets due to debt, including the process for releasing such claims within the platform.   * Temporary Restraining Orders (TROs): These are court orders restricting certain actions by merchants, potentially affecting their ability to access funds or process payments.   * Information Subpoenas and Restraining Notices (ISRNs): These are legal requests for financial information or orders preventing the transfer of assets, requiring Stripe to disclose merchant data or freeze funds.   * Garnishments: This involves the legal process of withholding funds from a merchant's account to satisfy a judgment.   * Bankruptcy: This covers the procedures and impacts on a merchant's ability to process payments and access funds when they declare bankruptcy.   Any insights you can provide would be greatly appreciated. "
    },
    {
      "thread_title": "FL Department of Highway Safety and Motor Vehicles MOU",
      "thread_body": "Wondering if anyone has been presented an MOU from the FL Dept of Hwy Safety/Motor Vehicles that reads like a security/privacy compliance document with liquidated damages and indemnities. It appears to be for vendors that are contracting with counties/cities in FL but that may integrate with certain Department systems relating to driver data. It's pretty strict and heavy-handed - trying to figure out if they will negotiate it to have typical cloud vendor protections. "
    },
    {
      "thread_title": "HR Training On Use Of AI (including LLMs for Drafting Sensitive Comms)?",
      "thread_body": "Has anyone developed an FAQ, training, or other guidance specifically around HR/People Team use of AI tools in the context of employment lifecycle events? I've done some foundational CLEs in this area, so I'm familiar with the standard guidance (e.g., always keep a human in the loop to avoid hallucinations, avoid fully automated decision-making in connection with these events, ensure all tools are tested for bias, and secure appropriate warranties/indemnities from vendors). That said, my team's questions are more nuanced than those basics. For example, they're particularly interested in what is and isn't advisable to input into general-purpose LLMs (like our Enterprise instance of ChatGPT) to  help compose documents like PIPs or sensitive employee communications. There are a number of the concerns and questions regarding topics like discoverability and privilege, how chat history would be handled for CCPA data access requests or state-level personnel records production requirements, and general fears about model bias.  Has anyone created an FAQ  or training like this? "
    },
    {
      "thread_title": "Policy On Internal Call Recordings",
      "thread_body": "Has anyone created a policy governing internal call recordings and transcriptions? This came up recently when an employee recorded a sensitive internal conversation without notice to others on the line. We are fully remote, so most of our conversations will happen in a context where recording is possible.  As a U.S.-only employer, our privacy policy already makes clear there's no expectation of privacy on company systems, so we're considering a notice-based model for internal calls (e.g. visual + verbal disclosure), rather than requiring express consent. Where we're getting stuck is how to handle sensitive conversations and internal power dynamics. For example:   * If a manager wants to record a challenging conversation with an employee (e.g. to document performance issues), can the employee opt out?   * What if the reverse is true, and an employee wants to record a call with a VP or senior leader during a sensitive conversation? Can the VP shut it down?    * Who and what determines whether a call can't be recorded?   * How do you guardrails to protect trust without creating a surveillance culture or chilling communications?     We're also exploring whether certain categories of conversations (e.g. HR, Legal, mental health support) should be categorically excluded or require advance approval (and from whom).  Would appreciate any thoughts on:   * Internal policies you've implemented and how they're working in practice   * What calls or conversations you never allow to be recorded   * How you balance transparency, documentation needs, and employee trust    * Any procedural controls that help avoid misuse or power imbalances   Thanks in advance. "
    },
    {
      "thread_title": "DoD Covered Borrowers Disclosure (Related To MLA and SCRA)",
      "thread_body": "I'm currently researching how financial firms, creditors, and fintech companies handle required disclosures related to DoD Covered Borrowers, specifically concerning the Military Lending Act (MLA) and the Servicemembers Civil Relief Act (SCRA). I'd appreciate any insights you could share on your approach. Do you typically integrate these disclosures into your Terms of Service or include them in agreements that users sign as part of your process? Are there any other methods you utilize for providing these disclosures? Thank you. "
    },
    {
      "thread_title": "Atty. Referral - Judgment Collection (Scottsdale, AZ)",
      "thread_body": "I'm reaching out for a contact of mine. I'm looking for an attorney in Scottsdale who specializes in judgment recoveries - Could just be an excellent litigator I imagine. "
    },
    {
      "thread_title": "RFP AI Tools",
      "thread_body": "We are in the search for an RFP AI tool to help streamline our process. Does anyone have tools that do this well currently?    Also, what teams generally own the end-to-end RFP process and related tools? "
    },
    {
      "thread_title": "AI Metrics",
      "thread_body": "Has anyone developed a metrics dashboard to support your AI strategy? Specifically, are you tracking the number of use cases within your department and evaluating their impact--whether through hard benefits like cost savings or soft benefits such as efficiency gains or career development opportunities? I'd really appreciate seeing examples or hearing how other organizations are approaching this. "
    },
    {
      "thread_title": "AI Notetakers",
      "thread_body": "Hoping to hear some perspectives on how those companies that have accepted widespread or limited use of AI notetakers are balancing the efficiency of the tool with the potential risk related to the discoverable written record created by the tool. Are you adjusting document retention policies to adapt to this use case? Are you treating it as a matter of behavior and training? Are you not concerned by it? "
    },
    {
      "thread_title": "US Employee In Malaysia",
      "thread_body": "We have a key employee moving to Malaysia for family reasons and are evaluating various options to continue her employment (digital nomad visa, etc.) or to hire her as a consultant. Anyone have any knowledge regarding employing a US employee moving to Malaysia, hiring a US citizen located in Malaysia, or hiring a former employee who moved to Malaysia as a consultant? Any recommendations for local counsel? Some other posts mentioned Trevor George de Silva at Eldan Law. However, he is no longer working at Eldan Law and I've been unable to track him down (yet). "
    },
    {
      "thread_title": "Outside Counsel Referral - Industrial Gas Procurement",
      "thread_body": "We're looking for outside counsel referrals with deep experience negotiating procurement of industrial gases. Appreciate any leads, and thanks in advance! "
    },
    {
      "thread_title": "Routine Legal Tasks Moved To Legal Ops",
      "thread_body": "I have been considering what daily and routine legal tasks could be moved from a lawyer to a legal operations position that would be supported by legal tech. Some things that come to mind are NDA management/review using preconfigured approved forms and AI, some e-discovery tasks, etc. I would love to hear from personal experience whether/how creation of a legal operations position at your companies has taken workload off of lawyers to free them up to perform more high-value work. "
    },
    {
      "thread_title": "Anyone Been Successful In Moving Away From Group Health Insurance Plans?",
      "thread_body": "We're exploring a shift away from traditional group health insurance (with skyrocketing premiums) toward an ICHRA model -- where we'd provide a tax-free stipend and let employees choose the plan that fits their needs, supported by a concierge platform like Gravie, Take Command, or Thatch. If you've: Transitioned to ICHRA at your company   Used one of these vendors (or others)   Navigated employee communications or rollout   Seen real impact (positive or painful).   I'd love to hear your experience.   Trying to stay generous and modern without burning money. "
    },
    {
      "thread_title": "Dental Market Data Privacy In UK",
      "thread_body": "Does anyone have experience working with dental practices as customers in the UK? I'm trying to understand what the commercial and market expectations are--specifically from these customers--regarding data residency or localization obligations for data processors. If you have insight or can point me to someone who does, I'd love to connect. "
    },
    {
      "thread_title": "Engagement Letters: Conflict Checks and Legal Privilege",
      "thread_body": "We're currently reviewing our engagement letter process with external counsel and would appreciate your insights and experiences, especially regarding best practices for managing conflict checks and ensuring attorney-client privilege.   Specifically, we're looking for guidance on the following:   1. Engagement Letter Structure - Our company does not provide a standard engagement letter template, and we rely on law firms to submit their own engagement letters. Do you ask for a master engagement letter with separate engagement confirmations per matter (detailing scope and parties involved), or a broader engagement letter that includes a clause allowing the firm to act on any future matters? In your experience, can detailed emails confirming scope and parties serve as effective engagement confirmations for individual matters?   2. Group Company Engagements - Do you typically have engagement letters signed by the holding company, or do you prefer having separate engagement letters for each group company involved in a specific matter? We're particularly interested in how this impacts conflict checks and maintaining privilege across entities.   Any real-world examples, policy tips, or pitfalls to avoid would be greatly appreciated!   Thanks in advance for your help. "
    },
    {
      "thread_title": "Contract Termination Agreement",
      "thread_body": "Does anyone have a short contract termination agreement? We're terminating two agreements that don't have termination clauses. I want to get a waiver for giving back payments. "
    },
    {
      "thread_title": "San Francisco Area Workers' Comp Attorney Referral",
      "thread_body": "A friend's brother in law had an accident at work in SF that is leaving him with some massive medical bills and I wanted to see if anyone could recommend a local worker's comp lawyer? "
    },
    {
      "thread_title": "Installment Billing - Implementation Through The Channel",
      "thread_body": "Does anyone have experience with standing up an installment billing program for SaaS in a two-tier channel model?  It would be great to understand how you implemented this if so (whether updating framework contracts or order documents or both) and how you dealt with the risk of (i) non payment at customer level and (ii) reseller / disti making different payment arrangements with their customer than you agreed with them. Would you be willing to get on a call with a member of my team to talk through what's worked and what to watch out for? "
    },
    {
      "thread_title": "HIPAA/Privacy Counsel for Health Tech/SaaS",
      "thread_body": "Looking to expand our bench of outside counsel and need recommendations for privacy counsel with deep HIPAA expertise, particularly around business associate obligations and compliance for health tech/SaaS vendor. Bonus points if they know the ACO space, but that isn't my primary focus/need right now. What we're looking for:   * Boutique firm or solo/small practice (not BigLaw)   * Strong HIPAA/healthcare privacy background, especially BA requirements   * Reasonable rates   * Responsive and practical approach   I've searched through older posts but haven't seen recent recommendations in this space. Would appreciate any names you'd be willing to share, either here or via DM. "
    },
    {
      "thread_title": "AI Based SOP Generator",
      "thread_body": "Does anyone have experience with a purchased or created AI tool that can easily create SOPs by following your screen flow, including screenshots and summaries of your clicks? I understand that Scribe and Whale are 2 such tools. "
    },
    {
      "thread_title": "Assumption of Risk - Unrecommended Use",
      "thread_body": "Have you had a client use your technology (hardware or software) in a way that is not recommended for safety reasons? If so, how did you deal with it? It's not a licensing question per say, but rather what about risks they create with third parties? Our agreements already allocate risk to the customer for use in violation of our user manuals, but trying to figure out if that is enough should something go wrong and a third party makes a claim. Not to mention reputational issues. Would love any insights from the braintrust! "
    },
    {
      "thread_title": "Malpractice/Employed Lawyer Insurance for In-house Counsel",
      "thread_body": "Does your company have malpractice insurance for its in-house legal team? Why or why not?    If you are in a state like California that requires employers to indemnify its employees, is that enough? (My questions are focused on non-officer employees who would not have protection under a D&O policy.) "
    },
    {
      "thread_title": "California Pro Bono Lawyer for Corporate Matters",
      "thread_body": "Can someone refer me to a California lawyer who represents pro bono clients on corporate matters? "
    },
    {
      "thread_title": "British Columbia Contract Attorney",
      "thread_body": "Looking for an attorney who can do just routine contract work. "
    },
    {
      "thread_title": "Management Profit Sharing Waterfall For PE Backed Company",
      "thread_body": "My company is PE backed. My management team and I are negotiating a new B shares exec comp package as part of a minority investment raise. For folks with a similar B share structure, does this look like a reasonable ask for profit sharing for the management team? MOIC <1.75 = 0% share.     1.75-1.95 = 10% share.   1.95-2.25 = 20% share.   2.25 - 3 = 30% share.   3+ = 40% share. "
    },
    {
      "thread_title": "Handling Strict State Requirements For Biz Registrations/Filings Re: Company Address",
      "thread_body": "Hi all - this is a specific request, but wanted to poll the hive in case any other fully remote companies are running into this issue. It appears that Oregon is cracking down on use of a PO Box or PMB as a business address for state filings. (Our HQ address is a PO Box.) We have a mail courier service that provides us with a secondary address (physical location) we can use, which has historically worked well. However, Oregon is not accepting that either, claiming we need a physical address where our business operates. We are a fully remote company and are struggling to come up with a workable solution here. What have other remote companies done to oblige strict requirements like this? Thanks in advance for any insights! "
    },
    {
      "thread_title": "SAFE Accounting Treatment - Debt vs. Equity",
      "thread_body": "Hey, Our auditors are currently treating our SAFEs as debt. I'm curious how your SAFEs are being treated. Has anyone successfully classified their SAFEs as equity rather than debt on your balance sheet? If so, what approach or documentation helped support this treatment, and what type of auditor did the analysis (Big 4, etc.)? Thank you! "
    },
    {
      "thread_title": "GRC Function",
      "thread_body": "Hi! The GRC function is now reporting to me, and I was wondering if anyone had any best practices to share, especially in terms of delineating scope between GRC and Security/IT. Looks like there are some past posts that are around security policies (and those have been archived), but I'd be curious for thoughts on a functional review of the role. Thank you! "
    },
    {
      "thread_title": "Cursor As AI Tool For Enhanced Efficiency In Coding",
      "thread_body": "Has anyone had any experience using or evaluating an AI tool called \"Cursor\"? It helps create code and content and has access to our codebase (though allows for enhanced privacy at the enterprise level and will not train on data). "
    },
    {
      "thread_title": "Corporate Governance Policy",
      "thread_body": "Hi. I'm drafting the Corporate Governance Policy for our Series B fintech startup. Does anyone have a good example or template they can share? Thank you! "
    },
    {
      "thread_title": "Looking For A Tax/Real Estate Attorney In SF Bay Area, CA",
      "thread_body": "In search of an attorney (small firm or solo) who can advise on residential real estate transfer to a trust, and accompanying tax issues. The property is in the San Francisco Bay Area if that makes a difference. It may be a simple matter, but outside of my wheelhouse, so cost-effective recommendations would be great. Thanks in advance. "
    },
    {
      "thread_title": "Panama Advisor",
      "thread_body": "Hi everyone! I'm looking for a reliable advisor in Panama who can answer some practical questions about entering into a deal with a Panama Foundation. Any recommendations? Thank you! "
    },
    {
      "thread_title": "Global Equity Experts",
      "thread_body": "Hi All - I am looking for an expert(s) in global equity structuring. I have been using Latham but have been disappointed at the time it takes them to respond as well as a lack of advance issue spotting that has already led to surprises so I am looking for a new expert with whom I can work. Please send any recommendations. "
    },
    {
      "thread_title": "RFP For International Law Firm",
      "thread_body": "Hi everyone, we are currently reevaluating our outside counsel. Does anyone have any advice on or template for extending an RFP to various firms? Thanks! "
    },
    {
      "thread_title": "Harvey.Ai",
      "thread_body": "Has anyone used Harvey Ai? What is your experience generally or specifically with its abilities to report on a larger number of contracts? We are using LinkSquares as our CLM but their AI capabilities are lacking. Thinking of layering on Harvey. Please include if you are in a Law Firm or Tech. I heard Harvey might be better suited for law firms. "
    },
    {
      "thread_title": "Fund Formation Counsel - Emerging Managers",
      "thread_body": "A friend of firm is launching their first ~$30M VC vehicle and is looking for counsel recs. Does anyone have a sense of cost for a fund of that size/any recommendations for reasonable fund counsel? "
    },
    {
      "thread_title": "Partner Buy-In - Architecture Firm (Minnesota)",
      "thread_body": "Looking for an attorney referral for a friend, that can help with partner buy-in to an architecture firm in Minnesota. Does anyone have a referral for someone familiar with the space? "
    },
    {
      "thread_title": "New York/New Jersey Tax Payroll Tax Expert",
      "thread_body": "Looking for someone who specializes in NY/NJ to advise us on payroll tax withholding. As we are switching from fully remote to hybrid, we would like some additional opinions on if taxes should be based fully on place of work (splitting remote + hybrid days for those living in different states) or based on stated of residence. We've received conflicting information. Thank you! "
    },
    {
      "thread_title": "AI Policy",
      "thread_body": "I am looking for a straightforward AI policy. If anyone has one that are willing to share, please send through. "
    },
    {
      "thread_title": "Anyone Have Any Experience With Using \"Aosphere\"",
      "thread_body": "In evaluating data privacy laws and whether or not they are applicable to your business, has anyone used Aosphere? I just saw a demo and have a limited POC running right now. Looking for any insights, benefits, shortcomings, etc. "
    },
    {
      "thread_title": "Corporate Counsel - Vietnam",
      "thread_body": "Does anyone have an updated recommendation for good external corporate counsel in Vietnam? I see a few recommendations but they appear to be outdated. "
    },
    {
      "thread_title": "KYB Questionnaire",
      "thread_body": "Hi, we are looking to run KYB on a potential customer who is based in India. We have already reached out to Hubspot and the cost for 1 customer is too high. "
    },
    {
      "thread_title": "CLM Metadata Migration Tips / Support Vendors?",
      "thread_body": "We're looking to change over our repository from Evisort to another CLM - Ironclad or SpotDraft - very soon. That said, we've got a lot of legacy agreements both in Salesforce/Evisort, and just in Salesforce, that need to be migrated into the new repository. The document migration itself isn't the part I'm concerned about, it's getting metadata / contract tags on all of the legacy imports to get us started off on the right foot / be able to use the repository properly. (Until AI truly knocks it out of the park, go-forward, part of our contract manager's role will be to 'close out' an executed contract by checking the tags / metadata for accuracy.) Frankly, I don't trust a lot of the metadata that's in Evisort right now - been lots of misses and incorrect tags (a lot came to light when doing an SFDC integration earlier this year and trying to pull things like emails for customer subprocessor notifications).  2 questions -  1\\. Has anyone used a provider / partner to help with this kind of migration & legacy tagging exercise? Wondering if this is something a LawTrades or Axiom person would be good for (or too operational)? *Particularly for Ironclad, since that isn't a service they seem to offer. (Looking for short-term help on a one-time project, so want to go the vendor/contractor route instead of interns or other type hires.)  2\\. Does anyone have experience with SpotDraft's supported migration / QC'ing that they offer as part of the implementation? Was it done well / timely?  "
    },
    {
      "thread_title": "UK Pension Plan Contributions",
      "thread_body": "We are working with a broker to update our UK pension plans and healthcare as we are not competitive anymore.  I would like to understand what is market in terms of employer and employee contributions into the pension plan. What does everyone else currently offer? "
    },
    {
      "thread_title": "Tax Specialist - Hong Kong",
      "thread_body": "We are looking for a tax specialist in Hong Kong in the context of the incorporation of subsidiary in Hong Kong (cost center only). Do you have any recommendations? "
    },
    {
      "thread_title": "NYC Commercial Real Estate Broker",
      "thread_body": "We're in the market for a new office. If you have a commercial real estate broker that you like, please let me know. Or if you have great office space that you're looking to sublet, let me know that also. Looking for space for roughly 200 people. "
    },
    {
      "thread_title": "Referral Request - VC/Investment/Nonprofit Lawyer Needed",
      "thread_body": "Looking for referrals for a friend who runs a grants program and needs legal counsel. They're seeking a VC/investment/nonprofit lawyer who can:   * Answer questions about grant structure and compliance   * Potentially draft documents for these grants, which may convert to equity if the grantee becomes a startup    * Advise whether a convertible grant approach is viable or if there are better alternatives   If you know someone who'd be a good fit for this type of work, please drop their info below or DM me. Thanks! "
    },
    {
      "thread_title": "Bank Account in Romania",
      "thread_body": "We are encountering an issue with AML / KYC process in our bank in Romania. The bank is asking for an excerpt from a government registrar that shows shareholders or beneficial owners of the company. As a Delaware company, I am not aware of a way to get such a government document. I've tried company-issued secretary letter / certificate - it has not been accepted. Has anyone seen this issue before? Or can you recommend a bank in Romania with which you have not had such issues? "
    },
    {
      "thread_title": "Guidance For US Travel",
      "thread_body": "We've been advised by some people managers that their employees are asking for specific guidance for navigating any potential issues and questions that may come up when they are traveling to the US for business. We want to address employee concerns but of course cannot serve as immigration counsel for individual employees so trying to walk a fine line. Has anyone developed a policy or talking points on this issue that they could share? "
    },
    {
      "thread_title": "Accounting Controls Policy",
      "thread_body": "Seeking sample policies on accounting controls (regarding who can take which actions, etc.), ideally for later-stage private company, auditor-vetted and simple. Thanks! "
    },
    {
      "thread_title": "Anyone Using Flank AI for Security Questionnaires? Seeking User Insights",
      "thread_body": "Is anyone here currently using Flank AI for completing security questionnaires? I'm looking for feedback--what's working, what's not, and any lessons learned (implementation, adoption, ROI, etc.). If you've evaluated or rolled out Flank AI: -What use cases are you solving?   -How was the onboarding and integration process?   -Any surprises, challenges, or tips?   -Would you recommend it to other legal ops teams? Feel free to DM me if you prefer to share privately. Thanks in advance for any insights! "
    },
    {
      "thread_title": "Data Mapping Template",
      "thread_body": "Does anyone have a template they could share? "
    },
    {
      "thread_title": "AWS Marketplace KYC Requirements for Transactions from South Korea",
      "thread_body": "AWS Marketplace requires sellers to go through its KYC verification process for sellers to \"get paid for Republic of Korea transactions.\" We're trying to understand if KYC is a requirement due to how AWS Marketplace is structured, or if this is a requirement to get paid by customers in South Korea generally and might apply outside of AWS Marketplace too. Thanks in advance! "
    },
    {
      "thread_title": "CLM to AI Workflows for Contracts",
      "thread_body": "Is anyone thinking about using AI workflows (example is Harvey's new workflows product) in place of CLM? It seems like the capabilities are converging -- custom workflows, review/drafting, vault, knowledge (for self-serve contracts questions). My non-expert perspective is that true AI agentic workflow for contracts management haven't been proven out yet. Still, I'm curious if others are preparing for a shift from today's rule-based workflows (like the leading CLMs) to AI first processes. "
    },
    {
      "thread_title": "Recommendations for Cyber Risk Insurance Providers",
      "thread_body": "We're in the process of benchmarking our current cyber risk insurance coverage in California and looking to get comparative quotes. I'd love to hear from those of you who have had positive experiences with Cyber Insurance companies, especially ones who provide good customer service and are reasonable on pricing and coverage terms. If you've worked with any companies you'd recommend (or would avoid), I'd appreciate any insight you're willing to share! "
    },
    {
      "thread_title": "Cursor Terms of Service",
      "thread_body": "I was wondering if anyone else has gotten hung up on the fact that Cursor's Terms of Service don't include a confidentiality obligation. I've noticed a clear distinction on other AI tools between the plans that include confidentiality obligations and those that don't, regardless of whether they may include language around not training on your data, etc. For example, ChatGPT Pro does not include confidentiality yet ChatGPT Enterprise Pro does. Same for Perplexity.   Cursor's new terms say they will use Content to provide the Service, comply with applicable law, enforce terms and policies, and keep the Service safe.  But there is no \"only\". They also say they won't train with the Content unless explicitly agreed. This does not feel like sufficient protection for source code. Am I missing something? Are there enterprise terms I haven't found? "
    },
    {
      "thread_title": "(Pro Bono) Immigration Counsel Recommendation Needed",
      "thread_body": "Was hoping to get some help from the group. I have someone I know who just received a denial of their Visa application after it was pending for 14 years. The person is obviously beside themself and I was hoping to see how I can help this person with options, advice, next steps etc. Anyone have a good pro bono immigration counsel / non-profit org recommendation and if necessary a good, efficient for-profit immigration counsel. Looking for someone ideally who also speaks Spanish and is located either in the SF / Bay Area or can help someone who resides in the SF / Bay Area (Peninsula). Thanks for any suggestions / recommendations. "
    },
    {
      "thread_title": "Use of Telemetry",
      "thread_body": "Question for those who use telemetry and dashboards for information not necessary for the security or for enforcing the licensing terms. How have you been able to collect this information (for customer's benefit) in light of the application of the EU Cookie regulations to telemetry which may require the customer to ask for the information first? "
    },
    {
      "thread_title": "Prize Supplier Agreement (US and international)",
      "thread_body": "One party provides a prize for a promotional contest or sweepstakes, and the other runs it and shares contestant info. Interested in US and Europe (GDPR) privacy clauses. "
    },
    {
      "thread_title": "Finance Committee Charter",
      "thread_body": "I'm looking specifically for examples of private companies with review constraints within finance committee charters. More specifically, delineations of retroactive review authorities vs approval requirements. Example would be quarterly review of any commercial agreement below $250k, as opposed to requisite committee approval of any commercial agreement above $250k. Similar interests for Capex and liability thresholds. Thanks! "
    },
    {
      "thread_title": "No Code/Low Code Agent/Chatbot for Legal?",
      "thread_body": "Greetings - I've been challenged by our CBO to find a solution to create a no code, low code agent/chat bot to respond to certain questions from the business team. My current thinking is to start with a proof a concept -- an agent that can respond to marketing questions from the business team. Two questions:    1. Does the brainstrust have suggestions for ways to create a no code, low code agent?   2. Has anyone in the braintrust already implemented an agent or proof of concept agent and be willing to chat live to discuss experience?   "
    },
    {
      "thread_title": "Invoice Review Services",
      "thread_body": "Any suggestions for Invoice Review Services that you have used with successful ROI in reviewing global law firm invoices? Exploring possibilities for a business partner in Europe. "
    },
    {
      "thread_title": "Private Company Ethics Committee Charter And Set Up",
      "thread_body": "We want to set up an internal Ethics Committee for oversight of whistleblower reports, ethics issues, etc. Can anyone share committee charter/templates? Thanks. "
    },
    {
      "thread_title": "AI-Generated Code And Restrictive Or Open Source License Checklist Or Process",
      "thread_body": "Hi and Happy Friday! Would anyone happen to have a checklist, process, or other resource that is used to help assess whether AI-generated code is subject to restrictive or undesirable open source licenses? "
    },
    {
      "thread_title": "Return To Office Policy - Legal Departments",
      "thread_body": "Our company is in the process of implementing a return to office policy, and I'm seeking to benchmark how other in-house Legal Departments have approached or responded to similar policies within their organizations. Specifically, if your company has implemented a return to office policy, I'd appreciate insights on: 1\\. Whether your Legal Department returned in full, hybrid, or remained remote 2\\. Does your Legal Department follow the guidance that was implemented company-wide, or is your Legal Department operating as an exception to the policy? If you're open to sharing, I'd be grateful to hear about your experience or point to any useful resources. Thank you in advance! "
    },
    {
      "thread_title": "Carricarte IP Licensing",
      "thread_body": "Does anyone have any experience with this patent licensor or its affiliated entity, re.ACT RTE, Inc.? If you have received a letter or otherwise dealt with them in the past, I'd love to connect! "
    },
    {
      "thread_title": "Singapore Employment Counsel",
      "thread_body": "Any recommendations for local employment counsel in Singapore? Preferably, we'd like a smaller firm that's based in Singapore.          "
    },
    {
      "thread_title": "NYC-Based Healthcare Litigator",
      "thread_body": "Hi Braintrust. Please share recommendations for a reasonably priced, aggressive NYC-based healthcare litigator to advise on a contract dispute. Thank you. "
    },
    {
      "thread_title": "Sana",
      "thread_body": "Does any member have experience using Sana (within legal or just in the enterprise in general)? "
    },
    {
      "thread_title": "Data Privacy Framework Or Local AWS?",
      "thread_body": "We are looking to expand into the UK primarily, but also the EU. I'm thinking about cross-border data transfers. Specifically, I'm weighing whether we should get a EU-US Data Privacy Framework (DPF) certification with the UK extension, or should we setup local AWS servers in the UK and EU. Does anyone else have experience with this? What should I be considering in making a decision? Thank you in advance! "
    },
    {
      "thread_title": "Equity Structure for Employees",
      "thread_body": "Looking for any high quality CLE's or other programs to learn more about structuring equity for employees/various comp structure options/public company equity grants, etc. Any insights would be appreciated. Thank you! "
    },
    {
      "thread_title": "Milwaukee-Based Employment Counsel (Plaintiff's Side)",
      "thread_body": "Please share recommendations for a reasonably priced employment counsel in the Milwaukee area to negotiate an exit package for a sales exec in Milwaukee (counter-party is a tech company, so plaintiff's side counsel would be great). Thank you in advance. "
    },
    {
      "thread_title": "Handling Equity In-House",
      "thread_body": "My company uses Carta and we have had outside counsel handling everything related to processing equity grants, terminations, board consents, etc through the Carta platform for us. I am looking to hire a paralegal to help me do this myself.  For anyone who has taken this over, any recommendations on what to look for in a paralegal to handle Carta other than a preference to having used Carta before? Would love to chat through any other considerations I should be thinking about. "
    },
    {
      "thread_title": "Email And Slack Retention Periods",
      "thread_body": "Looking for guidance on appropriate retention periods for Slack and email. Thanks! "
    },
    {
      "thread_title": "Cap Table Management",
      "thread_body": "Has anyone had any experience using Meji? "
    },
    {
      "thread_title": "CA and Federal Employment Leaves (FMLA, CFRA, PDL, PFL, etc.)",
      "thread_body": "Does anyone have some slides or maybe a summary of how the various CA and Federal Leave laws work? I have this one to share from Hoge Fenton, but curious if anyone else has anything they would be able to share that they've put together in-house or from outside counsel? Thank you. "
    },
    {
      "thread_title": "Transcend.io",
      "thread_body": "We are currently implementing Transcend.io for consent management and DSR Automation. It's a hairy project and I'd love to chat with someone who has implemented this at their company as I have a couple questions. Thank you! "
    },
    {
      "thread_title": "Services/Med Device Company Exclusivity Agreement",
      "thread_body": "Hi all, I'm looking for a recommendation for a sophisticated/experienced counsel to negotiate an exclusivity agreement between a medical device company and a service provider. The service provider will be the exclusive provider of the device in specified settings (and only offer that device). Any suggestions for counsel with expertise negotiating these types of agreements is appreciated. "
    },
    {
      "thread_title": "Venture Debt Counsel Recommendations",
      "thread_body": "We're moving forward with a debt transaction and need to engage outside counsel, ideally a firm at the lower end of the cost spectrum. Can anyone recommend some cost-effective options? Thanks! "
    },
    {
      "thread_title": "Microsoft 365 CLM & Legal Hold",
      "thread_body": "Hi. Has anyone used/recently seen a demo of Microsoft's CLM or Legal Hold tools? I'd love to hear any insights you may have on their capabilities. Let me know if you prefer to discuss live. "
    },
    {
      "thread_title": "Whisteblower Counsel",
      "thread_body": "Hi, A former colleague is looking for counsel to connect with re: a potential whisteblower action. I have asked not to be informed of any of the facts regarding the situation, but do know it is related to an employer. "
    },
    {
      "thread_title": "VC Fund Formation Expenses",
      "thread_body": "What are folks seeing as a proper legal budget to build a VC investment fund? We recently paid $120k using a Big Law firm. While the legal work was good, as we look to the next fund I am trying to assess whether $120k is reasonable. Seems high to me and but for the most complex, big ticket matters I think paying Big Law rates makes little sense. "
    },
    {
      "thread_title": "Q For Oil & Gas Lawyers in Alberta (Canada)?",
      "thread_body": "Hello, I have a friend visiting Alberta next week to scout oil/gas sites for stranded energy assets. He is working with a consultant/advisor called Twelvesix (headed by Blake Fikowski) 1) I'd love to speak to anyone with familiarity with Twelvesix and/or Mr. Fikowski.   2) More generally, would like intros to oil & gas firms in Alberta. I'd appreciate any knowledgeable reponses. "
    },
    {
      "thread_title": "Becoming A Marketplace Facilitator",
      "thread_body": "I would be grateful if anyone has any insights or experiences into launching a B2C marketplace as a marketplace facilitator, both in the US and international. E.g., would like to get an idea of realistic timing, advisors, issues, documentation. It seems like a big project but I would welcome hearing I am overthinking it. "
    },
    {
      "thread_title": "Has Anyone Worked Through \"Reconstituting\" The Founders Of A Startup?",
      "thread_body": "Scenario is a company founded by a single founder who hired a core team of 4 to develop a product and then departed the company soon after - before the product got any traction. That core team of 4 then led a complete pivot - they built a different product, sold via a different channel to a different customer. This is a significant new financial product - you could say this team invented it - and its looking good.  Board would like to recognize (and have the market and the team recognize) this core team of 4 as founders. And they're willing to invest some energy and reasonable expense to get that done. Just naming them founders wouldn't feel right to them since they didn't technically start the business and they respect the guy who did. After the founder left, we considered simply forming a new company actually founded by the core team of 4, but QSBS considerations prevailed and we did a recap instead.  Has anyone worked through \"reconstituting\" the founders of a startup? A negotiated arrangement with the actual founder may be possible, but particularly interested in any alternatives you've seen. We only see the benefits of this move if it truly feels legitimate to the team and anyone familiar with the company. This is all about the optics - we have a handle on the economics. Look forward to your ideas. "
    },
    {
      "thread_title": "Slack - External Connections",
      "thread_body": "Hey, Like many orgs, we leverage Slack extensively. Our employees occasionally request external Slack connections, which can include file sharing and bots. To manage the associated risks, we're looking to implement a formal review process. Does anyone have a risk assessment checklist or policy for this that they could share? "
    },
    {
      "thread_title": "Tuition Reimbursement Policy",
      "thread_body": "We are looking for a tuition reimbursement policy and any related forms (e.g. request forms/acknowledgements) that anyone would be willing to share. "
    },
    {
      "thread_title": "Law Firm in Mexico",
      "thread_body": "Hi there. Can anyone recommend a law firm in Mexico who would be able to translate our Services Agreement into Spanish? "
    },
    {
      "thread_title": "UK Payroll/Benefits Vendor",
      "thread_body": "We are hiring our first employee in the UK and need assistance setting up payroll, taxes, benefits, etc. Does anyone have any recommendations for a vendor or other resource that could help us get set up? Thank you in advance!  "
    },
    {
      "thread_title": "Family Law Recommendation - Fresno, CA",
      "thread_body": "I am looking for a reasonably priced family lawyer located in (or around) Fresno, California for a colleague. Thanks in advance for any tips! "
    },
    {
      "thread_title": "Turks & Caicos referral",
      "thread_body": "We are looking for outside counsel in Turks & Caicos and would appreciate any referrals. "
    },
    {
      "thread_title": "Criminal attorney in Los Cabos (Mexico)?",
      "thread_body": "I'm looking for referrals for a reputable and well connected criminal attorney in Los Cabos MEX. It involves the investigation of a suspicious death there this morning. Thanks for any suggestions. "
    },
    {
      "thread_title": "Event-Based Obligations",
      "thread_body": "Hi Everyone! We find it fairly easy to track date-based obligations in contracts, and have had success both with our prior CLM and by doing it manually in a calendar with reminders. The issue we are coming up against is how to track event-based obligations. We have a list we track at the moment, but does anyone have any recommendations? When we ask during CLM demos this seems to be a gap there as well. Thanks! "
    },
    {
      "thread_title": "Devs Using AI for Net-New Code",
      "thread_body": "Has anyone dealt with a situation in which their Dev team wants to move full steam ahead with using AI to help generate net-new code? Particularly, how did you frame the risks to leadership in order to ensure that they appreciated the potential impact on the business. Then, in the event that they agreed to take on the risk, what were strategies you employed for mitigating that risk as much as possible? "
    },
    {
      "thread_title": "Scout Marketing, LLC (Scoutyourcase.com)",
      "thread_body": "If anyone has intel on this company (who claims to specialize in helping plaintiff's law firms find cases), I'd love to hear from you. Thanks. ScoutYourCase. "
    },
    {
      "thread_title": "Contracting With An Entity Based In Honduras",
      "thread_body": "Hey there - one of our young AEs has brought in a prospect who is based in Honduras. At this point we are just at the MNDA stage - but it is a brave new world for here. Has anyone here ever been in contract with an entity in Honduras. Any words of wisdom? Thanks in advance. "
    },
    {
      "thread_title": "Updated IAB Terms",
      "thread_body": "For those involved in any capacity in digital advertising, have you or are you considering submitting a comment during the IAB's open comment period (closing July 21) on the proposed, updated IAB terms? While we are not part of the advertising tech ecosystem, we work with many clients that prefer to use IAB terms and so are considering submitting a comment. I'd love to hear from anyone else in the same boat in terms of how you are approaching the process. Thanks. "
    },
    {
      "thread_title": "Travel Reimbursement Policy",
      "thread_body": "Does anyone have a good travel reimbursement policy that could be shared? We are specifically focusing on flight reimbursements and giving some specific guidance as to the types of airline expenses that are appropriate. "
    },
    {
      "thread_title": "Employee Handbook With Pizazz?",
      "thread_body": "My HR wants to put some style into the revised handbook with pictures and graphics, not just the text. Does anyone have anything to share with me? Don't need content. "
    },
    {
      "thread_title": "Travel to China",
      "thread_body": "VCGC Peers - If any of you has had to address one of your investment professionals traveling to China, I'd love to hear from you on how you handled device (cell/computer) security. This would be one of our hedge fund investment professionals, so daily contact is important and being fully off the grid for a week won't work. We're trying to balance the need for communication with security and would love to hear if others have had to address a similar situation. Thanks, Matt P.S. I've searched the message boards and see there are other posts about device/travel security policies. I'm looking for more practical advice. "
    },
    {
      "thread_title": "AI Tools for HR tasks",
      "thread_body": "I would love to know how people are incorporating using AI tools in HR tasks, specifically recruiting? How did you get comfortable here especially from a GDPR and (german) employment law perspective? A few things we are thinking about:   * How exactly are you using AI (simply transcribing what was said; using AI to rank candidates).   * Do you ask for candidate consent specifically before the interview, or do you simply include it in your privacy policy?   * Did you perform a bias test or a Data Privacy Impact Assessment?   * What did you decide for the data deletion time period?   * Did you provide mandatory trainings for your interviewers to ensure they don't ask discriminatory questions (less worried about our HR team, more so other staff).   Thank you. "
    },
    {
      "thread_title": "OFSI License",
      "thread_body": "Please let me know if you can recommend counsel in the UK with expertise in securing licenses from OFSI in connection with transactions with OFSI-listed entities or individuals. "
    },
    {
      "thread_title": "California Corporate Law Counsel",
      "thread_body": "Looking a recommendation for a law firm to counsel an individual shareholder on their rights w/r/t a California corporation? The CEO amended a voting rights agreement that didn't require the consent of all the shareholders subject to that agreement and trying to figure out rights under California law to support a claim to contest some of the CEO's actions. "
    },
    {
      "thread_title": "EU Packaging and Packaging Waste Regulation (PPWR)",
      "thread_body": "Hello! I have a need to learn more about the EU Packaging and Packaging Waste Regulation (PPWR). If anyone, particularly in a consumer products company, has done any legwork they'd care to share, either in a writing or in a call for download, I'd appreciate it! I'm also interested to know of recommended CLE resources on this topic - The European Commission has posted a video, but it's 9+ hours long! "
    },
    {
      "thread_title": "German Corporate Credit Cards",
      "thread_body": "Hello, Does anyone have an entity in Germany that provides corporate credit cards? We are trying to role this out, but are getting push back from the Workers Council based on the following: Regulation on Interchange Fees for Card-Based Payment Transactions (2015/751), Recital (38):\"Payment service providers should ensure a clear distinction between consumer cards and corporate cards, both from a technical and an economic perspective. It is therefore important to define a corporate card as a payment instrument that is used solely for business or official expenses and is directly debited from the account of the undertaking or public entity.\" Curious if anyone has any direct insight. "
    },
    {
      "thread_title": "ISO Advisor/Consultant To Identify China Partner For Ph3 Clinical Trial",
      "thread_body": "We are looking to find a Chinese company partner for our Phase 3 trial in China. Does anyone have recommendations for an advisor or consulting group that can help us identify the partner? We're looking for a group with strong ties to China. "
    },
    {
      "thread_title": "M&A Counsel For Sell Side With Dual HQ (EU and US) $2.5BN+ Valuation",
      "thread_body": "A friend is looking for recommendations for sell side counsel for a SaaS company going through an exit. Valuation will be between $2.5BN and $4BN. European based parent company, but SaaS entity is dual headquartered in Europe and U.S. Not just looking for all the usual suspects at the big firms, but someone who will really be pragmatic and efficient, and may consider an alternative fee arrangement. "
    },
    {
      "thread_title": "NMLS Fingerprinting In Brazil and Portugal",
      "thread_body": "I need to help some high-net-worth individuals who live in Brazil and Portugal through the process of submitting MU2s and fingerprints to NMLS, and it would be great to find Portuguese speakers in either country who have done this before, particularly the fingerprinting. Suggestions would be very welcome. "
    },
    {
      "thread_title": "Secondary Lenders/Contact Request",
      "thread_body": "Aloha! I am trying to help my client in short order get connected to any sales/lenders at these institutions. Does anyone have any contacts at these lenders? Bluevine, Fundbox, Rapid Finance, Fora Financial. "
    },
    {
      "thread_title": "Data Mapping Template",
      "thread_body": "Does anyone have a template for working with data and R&D team to map flows of customer data, particularly with third party subcontractors? "
    },
    {
      "thread_title": "DORA - Supporting A Critical Business Function",
      "thread_body": "Hi! For those of you who have European clients who have designated your firm as being an ICT service provider who support a critical business function, I'd love to hear from you as to how you are approaching this, given the onerous additional Article 30 obligations. Are you charging those clients a premium for the exercise of these additional rights? "
    },
    {
      "thread_title": "Document Comparison Tools",
      "thread_body": "Hello! My team is looking for a comprehensive and user-friendly document comparison tool. We currently use Word but would love to find something that can compare between PDFs/docs. I know Litera is a popular one, but I was wondering if anyone has any more budget-friendly suggestions. Thanks! "
    },
    {
      "thread_title": "Globalizing Corporate Bonus Programs",
      "thread_body": "What have other multi-national employers done with respect to ex-US employees participating in corporate bonus programs? So far, we do not have employees eligible for a new corporate bonus program outside of the U.S. (it's only for VP+ employees) but the bonus program will likely expand over time. Our global employment counsel has advised either globalizing the bonus plan (similar to what we have done for our commission plan), add country-specific riders, or fully and expressly incorporate the bonus terms into the contracts rather than referencing the standalone program document. Curious to learn what your experience has been and any lessons learned. "
    },
    {
      "thread_title": "Plaintiff Employment Attorney In Ohio",
      "thread_body": "Hey everyone, a friend of a friend is looking for plaintiff's side employment counsel in Ohio (Cincinatti would be best). Possible wrongful termination - but at this point just needs some advice. Thanks in advance for any leads. "
    },
    {
      "thread_title": "GitHub Copilot: All Areas Of Codebase?",
      "thread_body": "For those who are permitting the use of GitHub Copilot: Have you opened it up to all areas of the codebase or are you limiting it to certain areas only (and if so, why)?        In the process of developing a policy to set guardrails around its use, and I want to get an updated response on this question. This also assumes that appropriate restrictions will be put in place (use of the Enterprise License only, attribution requirements, duplication detection filter, human code review, etc.). "
    },
    {
      "thread_title": "Apostille Services In Charlotte, North Carolina (For Use In Bulgaria)",
      "thread_body": "I need a document notarized and apostilled for use in Bulgaria. In Austin, TX, we get this done at one of the UPS offices downtown, but I believe that UPS in Charlotte does not offer this service. Any referrals would be sincerely appreciated! "
    },
    {
      "thread_title": "AI/Healthcare Regulatory Counsel",
      "thread_body": "All - I'd be grateful for any recommendations for counsel that can provide AI expertise in the (B2B) healthcare regulatory context. We are a SAAS platform provider; customers are hospital systems, ACOs, CINs, payors and other healthcare institutions. "
    },
    {
      "thread_title": "Startup - Attorney Recommendation",
      "thread_body": "An industry colleague is looking for a lawyer with expertise/experience in drafting OMs and associated docs for a startup without having to pay big-firm fees. I'd appreciate your sharing any recommendations. Thank you. "
    },
    {
      "thread_title": "Clinical Lab Billing Services Provider",
      "thread_body": "Seeking recommendations for a clinical lab billing services provider with expertise in billing,  market access, reimbursement and appeals processes with major insurance companies operating in (but not limited to) New York state, specifically concerning whole genome sequencing and whole genome transcriptome sequencing. Thanks in advance. "
    },
    {
      "thread_title": "Data Governance Approaches",
      "thread_body": "Hi! Hoping to tap into you all for some info on different companies' approaches to Data Governance. We have begun our Data Governance journey but our lead is looking to better understand how other companies have approached their data governance initiatives. If anyone is open to discussing their approaches or connecting my DG lead with your DG lead, please let me know. "
    },
    {
      "thread_title": "CA SB 261 Compliance",
      "thread_body": "Curious to hear how companies subject to CA SB 261's requirement to release a report detailing climate related financial risk by 1/1/2026 are going about preparing that report.  I'm specifically interested in hearing whether folks have engaged an outside firm (e.g., KPMG, Watershed, S&P, law firms, etc.) to conduct a climate risk assessment as an input to that report (and to ultimately produce that report in whatever format CA will require). "
    },
    {
      "thread_title": "Attorney Recommendation For Acquisition Of Small Digital Business",
      "thread_body": "Hi all, a friend of mine is in the process of acquiring a small digital marketing business, with a deal size around $800K, and he's currently looking for a legal counsel to help with the acquisition, specifically the asset purchase agreement. Would greatly appreciate your recommendation of attorneys that would be a great fit, thank you in advance! "
    },
    {
      "thread_title": "Fractional CFO",
      "thread_body": "Hi, I am considering a fractional CFO. Do you have anyone you'd recommend? "
    },
    {
      "thread_title": "Lease Management Software Or AI",
      "thread_body": "Hello! I am looking for some type of software to assist with real property Lease management tasks. E.g.- lays out lease covenants, tenant improvement procedures and requirements, renewals/expirations, changes in rent calculations, etc. Thank you for your recommendations! "
    },
    {
      "thread_title": "Proprietary Technology Statement",
      "thread_body": "Has anyone drafted a Proprietary Technology Statement that they would be comfortable sharing as a template? "
    },
    {
      "thread_title": "Private Investigator In Canada",
      "thread_body": "I am looking for a private investigator in Canada. Does anyone have any recommendations by chance? "
    },
    {
      "thread_title": "AI Tool For Generating PPTs",
      "thread_body": "Any recommendations on an AI tool that helps build PPT decks? Looking for a tool for company use. Must have appropriate data use and security terms (e.g. no training on our data, ability to delete data inputs at any time, appropriate security etc.) "
    },
    {
      "thread_title": "Contingency Fee Lawyer For Bank Case",
      "thread_body": "Hi, does anybody know one of these. My friend's business lost $20K or so because of a bank error that routed several customer payments to someone else. I know it's not a lot of money, so somebody relatively junior is fine. Thanks for your help. "
    },
    {
      "thread_title": "Conflict Waiver Language From Law Firms",
      "thread_body": "Hello - trying to get some info on trends in what firms will and will not agree to in conflict waiver language in outside counsel guidelines. We continue to see firms taking hard line positions (even stronger than the carve outs for advance transactional waivers that we started seeing 5+ years ago). Is it worth pushing back? Are they really just trying to manage various offices/entities (of both firm and client)? Seems that that would be pretty easily automated these days so not sure it's an efficiency issue. Curious if others have been seeing more of this lately. Thanks! "
    },
    {
      "thread_title": "Localizing Your SaaS Contract For Foreign Jurisdictions",
      "thread_body": "Hi, Wondering if anyone is localizing their outbound B2B SaaS contracts for local markets, such as for German market, or Swiss market. If yes - when did you decide to do it and what was driving this decision? Has it improved contracting cycles in such market? "
    },
    {
      "thread_title": "DPA - Australia / Canada Compliant",
      "thread_body": "Hi, Does anyone have a form Data Processing Addendum that they use for Australia or Canada SaaS agreements?  "
    },
    {
      "thread_title": "ISO Sanctions Vetting Tool",
      "thread_body": "Hi everyone - As we continue to scale our compliance function, we're exploring whether there are any sanctions vetting tools that make the process less manual. For instance, we're looking for any tools that leverage AI to automate some of the easy calls; have reliable, easy-to-use integrations with Salesforce to vet prospects and perform ongoing customer scans; and are somewhat customizable.  I know there were some threads on this from a few years ago, but given recent developments with AI, does anyone have any recommendations for reliable vetting tools? Thanks! "
    },
    {
      "thread_title": "Exempt-to-Non-Exempt Reclassification for Sales Roles (US/CA)",
      "thread_body": "Has anyone here gone through a reclassification process in the U.S., particularly involving sales roles (e.g., BDRs, AEs) and with California in scope? I've recently joined my current company and have been looking into this issue as part of a broader payroll system transition. I've proposed the standard compliant route: reclassifying certain roles from exempt to non-exempt, tracking actual time worked via timesheets, and clearly \"providing\" (but not policing) meal and rest breaks in line with CA law. The plan would include having employees sign updated break policies and certify weekly on timesheets that they were offered all required breaks. Potentially it would also include a mechanism for pre-approval of overtime. That said -- I've been asked (unsurprisingly) whether other tech companies have found more \"elegant\" solutions. The concern isn't just about the admin of tracking hours -- it's also the cost of paying overtime. I'm fully aware of the legal requirements, but I need to understand what others are doing in practice -- especially in go-to-market orgs where the business feels that hourly classification undermines culture or incentives. If you've taken a different approach (or fought for the standard one and won), I'd really value hearing how you handled the legal, operational, and cultural angles. Feel free to DM if easier. Thanks! "
    },
    {
      "thread_title": "Agiloft Consultant",
      "thread_body": "Has anyone worked with a consultant for Agiloft CLM implementation, improvements or outsourced admin? If so, please let me know recommendations, whether you though it was valuable and any tips/cautions. We are looking at Qualitas (recommended by Agiloft) and interested in assessing another option for comparison. Thanks!  "
    },
    {
      "thread_title": "FTC Click To Cancel",
      "thread_body": "Given that the 8th Circuit has vacated the FTC's Click to Cancel rule at the 11th hour, I wanted to see what subscription-based companies are doing in light of the decision. We were completely ready to go with updates to our sign up processes, and now the team is frustrated they put in all this work for nothing. I argued that there are still the equivalent state-level rules that impact us, but am wondering if folks are scaling back on compliance with any specific aspect of the rule. (We updated our signup process to require affirmative consent of our Terms and Privacy Policy, consent to automatic billing, and also providing the required disclosures -- our cancellation process was compliant so we have no concerns there). "
    },
    {
      "thread_title": "Privacy Counsel",
      "thread_body": "Hi, I'm looking for a recommendation for top tier privacy counsel as we start looking at building a privacy program. We've been working with Gunderson, but having a poor experience. "
    },
    {
      "thread_title": "UK And Germany Employee Time Tracking",
      "thread_body": "We're looking to benchmark how tech companies with operations in UK and Germany are handling time tracking for non-hourly employees to comply with working time regulations in those regions. Any feedback from a best practices and ease of administration perspective would be greatly appreciated! "
    },
    {
      "thread_title": "Public Company In-House Counsel: MNDAs Before Contract Negotations?",
      "thread_body": "Hi public company in-house counsel: Do you require a MNDA or other confidentiality agreement before your business teams negotiate contracts with potential service providers, or instead do you simply guide them on permissible disclosures prior to having a signed contract that will include confidentiality protections? Why or why not? I'm evaluating our commercial legal team's impact with MNDAs etc. pre-contract. Thanks! "
    },
    {
      "thread_title": "AI Enabled Privacy Automation Tools",
      "thread_body": "Hi All, I am looking for recommendations on an AI-enabled privacy automation tool. We've been using OneTrust, and it's clunky, highly manual, and expensive. I appreciate all feedback. "
    },
    {
      "thread_title": "Fleet Entity In Indiana",
      "thread_body": "Does anyone have a recommendation for counsel to assist with setting up a fleet entity in Indiana? "
    },
    {
      "thread_title": "Global Regulatory Compliance",
      "thread_body": "Hi all! Would appreciate your input on what has worked for your team in terms of managing global regulatory compliance while scaling as a business. We're finding that we're running up against 2 issues as a SaaS business with an increasing number of global customers: i) identifying all global laws that we are required to comply with (e.g., privacy laws, tax laws, AML laws, etc.) and ii) keeping up-to-date with all these global laws. Has your team used any software or joined any association to help track applicable global regulatory requirements? "
    },
    {
      "thread_title": "CLM Software - Analytics Features",
      "thread_body": "Hi all - we're using LinkSquares as our CLM software and looking to see how best to leverage its analytics features (i.e., Reports & Dashboard). For those of you who are using LinkSquares or other comparable CLM software, what types of data or reports does your company value the most in terms of gaining visibility into the types of agreements the company is entering into (e.g., number of agreements with auto-renewal language, the types of liability language we're typically agreeing to, etc.)? Thanks! "
    },
    {
      "thread_title": "Big Beautiful Bill Impact Dissemination",
      "thread_body": "Seeking any non-politicized summaries of business impacts faced by US based SaaS/Tech companies from the Big Beautiful Bill recently passed. "
    },
    {
      "thread_title": "Referral For Washington State Employment Lawyer",
      "thread_body": "Hi! Looking for a Washington employment law referral to represent an individual plaintiff in a wrongful termination. Any names would be great! "
    },
    {
      "thread_title": "Lien Seniority As Part Of An Easement Agreement",
      "thread_body": "We are considering acquiring a piece of property from a third party, and that third party will only sell if they can maintain an easement on the property to maintain a sign there. The third party is also demanding that their easement remain senior to any future mortgage (if any) because they are afraid their easement could get wiped away in the event of a foreclosure.   In my opinion, a commercial lender will never agree to anything other than being the senior lien holder, but they would agree to a Subordination, Nondisturbance, and Attornment Agreement (SNDA) that would effectively provide them with the protection that they need. Has anyone dealt with a similar issue before? Any commercial lending experts? Would a commercial lender actually allow themselves to be junior to this type of easement? "
    },
    {
      "thread_title": "Tracking Free Time And Other Value Adds",
      "thread_body": "Hi all! We are looking for a data-driven way to track value adds that our law firm partners provide us (complimentary partner hours, hotline/office hours, trainings, etc.). Has anyone been successful in finding a method that works for both the corporate and law firm sides? "
    },
    {
      "thread_title": "Senior SaaS Trainer For My Team",
      "thread_body": "Does anyone know of a senior commercial SaaS lawyer who sells time flexibly? I'm looking for someone experienced to train up my team on a consultancy basis. "
    },
    {
      "thread_title": "Shutting Off Employee Access To Free Versions Of ChatGPT",
      "thread_body": "Hi TechGC. We've learned some Security teams are shutting off access to free versions of ChatGPT and similar LLMs to give their internal AI use policy more \"teeth\" and ensure that employees aren't sharing confidential company data or personal information without an enterprise license. We're trying to benchmark. Is that something you're also doing or considering? Thank you for any insight. "
    },
    {
      "thread_title": "NYC Good Cause Eviction Question",
      "thread_body": "Hi, A bit off-topic but I couldn't find the answer anywhere to this question. If a building that otherwise is subject to the GCE law in NYC has multiple certificates of occupancy (before and after the law), should we count the first or the latest for purposes of determining if such building can use an exemption or not. I'd appreciate your help with this. Thanks. "
    },
    {
      "thread_title": "CX AI",
      "thread_body": "Does anyone on the consumer facing side have experience with any of the following CX platforms? Would love to chat (and possibly connect other team members) if yes. Thanks!   * Decagon AI   * Sierra AI   * Digital Genius    "
    },
    {
      "thread_title": "Minnesota Transactional Counsel",
      "thread_body": "Australia company looking for local counsel to help with a distribution agreement with Minnesota reseller. "
    },
    {
      "thread_title": "AI Policy - Code Scanner",
      "thread_body": "In some of the AI policy examples posted in the Peer Documents, I noticed a reference to \"code scanners\" that help ensure that no third-party IP is included in the code output from AI tools. Does anyone have guidance on which code scanners you're using or would suggest? "
    },
    {
      "thread_title": "Offer In Form Of Presentation Rather Than Letter",
      "thread_body": "I'm looking into precedents for employment/service Offers in the form of presentations (i.e., slide decks) rather than traditional letters. Anyone examined the enforceability of something like this? "
    },
    {
      "thread_title": "RIA - Compliance Consultant Fee",
      "thread_body": "Dear, We are an RIA firm and currently use IQEQ as our compliance consultant. Their monthly fee is quite high relative to the actual time they spend on our matters -- usually just a monthly call and addressing one or two questions at most. (To be fair, the fee also includes access to the gVue platform, but almost all filings are charged separately.) Our firm is considering re-negotiating this fee, and I would appreciate your advice on what you think is a reasonable range for a monthly charge that covers \"platform + general support.\" Any insights or tips you can share would be greatly appreciated. Many thanks in advance. "
    },
    {
      "thread_title": "Seeking Illinois Employee-Side Employment Counsel To Review And Negotiate Severance",
      "thread_body": "Seeking an Illinois employee-side referral for a friend who was terminated in a restructuring after 3.5 yrs with the company. She is seeking a review of her severance package and help negotiating it since she had been there from Series A through IPO. She was a VP and helped the company go public this year. The company is incorporated in DE and headquartered in AZ, but she works remotely and her residence is in IL. Hoping for someone cost effective for counseling, since she is not necessarily litigation focused at this stage, but there are potential race and gender disparities in promotion patterns and pay.      Thanks so much for any leads. "
    },
    {
      "thread_title": "Sense Check On EU AI Act",
      "thread_body": "We are a UK SaaS company providing services to the EU market. The product team are looking at integrating AI systems into our offering, e.g. AI powered data filtering, chat bots, and the like. On assessment our intended use cases will be \"low-risk\" (or rather, not \"high-risk\"). We will be a \"deployer\" rather than a \"provider\" of AI systems. I had originally thought/assumed there would be some basic transparency obligations under the Act. However, in reading Article 50, it seems that perhaps even this is not required. Article 50 seems to specify transparency obligations for deployers:   1. of  \"an emotion recognition system or a biometric categorisation system\", and/or   2. where the AI system \"generates or manipulates image, audio or video content constituting a deep fake\", and/or   3. where the AI system \"generates or manipulates text which is published with the purpose of informing the public on matters of public interest shall disclose that the text has been artificially generated or manipulated\".   None of these apply to our intended use cases. As such, am I correct in thinking that there are no transparency obligations when a user interacts with our integrated AI systems? Grateful for the views of any deployers with similar use cases that have already undertaken this assessment. "
    },
    {
      "thread_title": "Click-Thru Platform",
      "thread_body": "Does anyone have good experience or recommendations with a commercial \"click-thru\" platform? Looking for a scroll to the bottom and press agree type solution that has robust outputs for obligation management. Thank you! "
    },
    {
      "thread_title": "Plaintiff's Medical Malpractice Attorney In Houston Area",
      "thread_body": "Can anybody recommend a good Plaintiff's Medical Malpractice attorney in the Houston Area? Asking for a family member who suffered from brain cancer. Thank you in advance. "
    },
    {
      "thread_title": "Law Firm Discounts",
      "thread_body": "Hi, Looking for the latest on what people are seeing as market when it comes to big law firm discounts, both for private company and venture fund clients. Are your discounts time bound? What ranges are you getting these days? Thank you. "
    },
    {
      "thread_title": "Surveying Outside Counsel On AI Usage",
      "thread_body": "Hello everyone - curious if any legal departments have surveyed their outside counsel firms to get a read on exactly how they are using AI, what tools for which tasks, and documenting any client benefits (especially specific to your work)? Stats like this from a recent Axiom survey make me wonder. \"With 79% of law firms using AI but only 6% passing savings to clients, in-house departments face a cruel irony: they must invest in AI capabilities while their outside counsel benefits from AI efficiencies without sharing cost savings. "
    },
    {
      "thread_title": "Legal Operations & AI Goals",
      "thread_body": "Hey Everyone, I'm working on setting my goals for the rest of 2025 and would love to hear what others are planning. Most of my goals over the past couple years have been centered around CLM. Our CLM is finally in a good place and I'm ready to move on to other things. If you're open to sharing, I'd love to hear what you're focused on (especially interested in AI goals). I'm hoping to gather some fresh ideas (beyond what my sidekick Gemini and I have some up with so far). "
    },
    {
      "thread_title": "Carry Structuring For US Firm With UK Employees",
      "thread_body": "Hi all, I'm looking for advice and market norms around how best to structure and grant carry for UK employees from US funds. Issues on my mind include:   1. how folks think about parity between US and UK grantees considering different tax schemes (i.e., grant the same amount of carry regardless of location or try to balance with additional carry or comp to compensate for variable tax rates?)   2. whether folks use a feeder structure or issue carry directly   3. process - UK equivalents to an 83(b) and other similar issues   4. anything else major I'm missing?   "
    },
    {
      "thread_title": "Additional AI Tools to Existing CLM Tool",
      "thread_body": "Hi, We use Ironclad for our CLM. To date, we've held off on spending a ton of time exploring its AI playbooks / redlining functionality, because these native features are only available in Ironclad's native Editor. Our attorneys (fairly) use Word to edit, so it's felt pointless to explore. The problem is that our need for AI intervention in the contract redlining and negotiation process is growing bigger every day, yet we need to keep Ironclad in place for various reasons. What other tools/systems have others found truly valuable in terms of layering an additional AI negotiation tool on top of an existing CLM (be it Ironclad or otherwise)? Where should we be pivoting our attention? "
    },
    {
      "thread_title": "CPT - ICD10 Licenses",
      "thread_body": "Does anyone have recommendations on the best way to determine if a CPT or ICD-10 license is required for specific use cases? Additionally, if it turns out a license is needed, I would greatly appreciate recommendations on lawyers or experts who specialize in this area and could provide some guidance. Thanks in advance! "
    },
    {
      "thread_title": "Pixsy Copyright Letters",
      "thread_body": "Hello, has anyone dealt with getting a copyright infringement letter from Pixsy? Would appreciate any insight on how they operate and what was or was not successful in your dealings with them. Thank you! "
    },
    {
      "thread_title": "Commercial Lender Referrals",
      "thread_body": "I could use some referrals for a commercial lender contact, particularly with Tennessee affiliations. Thanks! "
    },
    {
      "thread_title": "CLM - Condor",
      "thread_body": "Has anyone had any experience working on Condor (a Pega-powered, intelligent, and adaptive contract automation solution) from Pegasystems? If yes, would you be open to a conversation? "
    },
    {
      "thread_title": "Legal Engineer vs. Legal Operations",
      "thread_body": "Article for context: They define \"legal engineering\" as \"the application of technology and process design to legal work. Legal engineers help legal teams build, implement, and troubleshoot tech solutions that streamline workflows, automate routine tasks, and enhance service delivery.\" I love the title \"legal engineer,\" but it feels like it's essentially Legal Operations. Have you heard of a \"legal engineer\" before? And how do you feel it might fit in with Legal Operations as it already exists? "
    },
    {
      "thread_title": "Ironclad Professional Services",
      "thread_body": "Does anyone here have recent experience onboarding/implementing Ironclad and leveraging their in-house professional services? I would love to get your thoughts and hear if it was a success. Separately, has anyone handled historical data migration into Ironclad on their own? "
    },
    {
      "thread_title": "Fund Counsel in Cayman",
      "thread_body": "Looking for recommendations for Cayman Islands-based law firms that can assist with fund formation work. Not Maples. "
    },
    {
      "thread_title": "Detroit Based Corporate Litigator for B2B Software Companies",
      "thread_body": "Any recommendation for a Detroit based commercial litigator at a small to midsized firm with experience representing B2B software companies would be appreciated. The matter relates to a commercial dispute in connection with data sharing by a vendor in the context of a business partnership split/breakup. "
    },
    {
      "thread_title": "General Partner Investment Vehicle (Exempt Reporting Advisers)",
      "thread_body": "Are there any ERAs out there where the general partners of the firm have a separate investment vehicle for personal investments (e.g., for private company investments that are not appropriate targets for the funds)? If so, does your firm's management company handle operations for that vehicle, or is it complete separate from the management company? "
    },
    {
      "thread_title": "AI Voice Calls - FCC / TSR / TCPA Compliance",
      "thread_body": "Has anyone recently considered AI voice calls in light of the FCC ruling classifying AI calls as \"robocalls\"? We are experimenting with AI voice calls where we have prior express written consent to contact but struggling with the TSR and TCPA requirement on \"abandoned calls\" (ie. that use of \"robocalls\" requires the marketer to stay below 3% of calls failing to transfer to a live agent in 2 seconds, which our AI calls would not because the point is that AI can handle some portion of the calls independently). This seems like an issue of the law not totally aligning with technology but curious if anyone has gotten comfortable with a way to use AI voice calls in the US where you do have consent of the person being contacted. "
    },
    {
      "thread_title": "Legal Support in Mexico (Contractor)",
      "thread_body": "Hi all, We are looking for commercial support for our local operations in Mexico. At the moment, we are looking for a contractor to help manage commercial agreements and work with the local sales team in standing up processes. Would welcome any of the following:   * range of rates you may have seen for lawyers/nonlawyers in Mexico City.   * recommendations of individuals who might be available support this type of work (non-law firm)   * any agencies you have worked with for placement of an attorney/non-attorney in Mexico City.   "
    },
    {
      "thread_title": "Attorneys Specializing In Housing Accessibility (ADA and HUD)",
      "thread_body": "Hello - We are looking for an attorney specializing in housing accessibility to provide ongoing counseling on the ADA and navigating reasonable accommodation requests in the multifamily housing space. I'm open to working with attorneys located/barred anywhere in the U.S. Thanks in advance for any suggestions. "
    },
    {
      "thread_title": "LP-Led Secondaries",
      "thread_body": "Hi all - I'm curious about other GPs' stance on LP-led secondaries, particularly in light of their increasing popularity. Realizing it's highly dependent on the circumstances, it'd be helpful to get a gauge on the general sentiment on requests to sell fund interests as part of a broader sale by an institutional LP. Any transfer is subject to our approval, and we've historically been resistant to transfers outside of affiliate transfers or estate planning. Putting aside the IR aspect of managing the relationship with the selling LP, what other considerations have folks considered?  Immediate ones for me are the opportunity to foster the relationship with the secondary buyer and potentially commit to future funds; the taint of being uncooperative; potentially exchanging our approval for the buyer's pre-approval of a future LPAC or LP action (e.g., fund term extension); and optimizing our LP roster for known and trusted relationships. "
    },
    {
      "thread_title": "[Anonymous post] AI Discovery Tools",
      "thread_body": "Anonymously posting on behalf of a TechGC member: Does anyone have recommendations for AI discovery tools? We are the plaintiffs in a lawsuit and want to cut down on external counsel discovery costs by ingesting some of the defendant's document production through an AI tool on our own. Appreciate any leads! "
    },
    {
      "thread_title": "AI Training For Employees",
      "thread_body": "While we have a formal AI policy, we do not yet have formal AI training for employees. Does anyone have a simple framework/deck they've used to train on responsible AI use or used a third-party vendor's training module? We'd like to avoid paying a lot for a simple training module we can create ourselves, but also don't want to reinvent the wheel. "
    },
    {
      "thread_title": "Evisort Tips & Tricks",
      "thread_body": "Attention Evisort power users! We've recently adopted Evisort as our CLM (previously manually managing contracts in DropBox and Google Sheets). The learning curve has been a bit steep. What tips do you have for getting the best use out of Evisort? "
    },
    {
      "thread_title": "Employee Co-Invest?",
      "thread_body": "Hi all - I am wondering whether any venture firms offer employees co-investment opportunities into portfolio company investments (separate from carry indirectly), and if so what the program looks like in terms of when to offer co-investment relative to main fund allocations, on what terms, and how to manage conflicts of interest. This seems like a potential challenge from both a fiduciary and administrative standpoint, but I heard from someone on my team about other (i.e., unnamed) firms offering this so am hoping to gather data points. Thanks in advance! "
    },
    {
      "thread_title": "Lawyer Not Registered In CA Working For A CA-Based Company",
      "thread_body": "Hi all, Does anyone know whether there is a requirement for lawyers working for a CA-based company to be registered in CA? I saw this old thread and want to check whether the advice remains correct. I am resident in NY and need to know if I need to get registered in CA. I cannot rely on Rule 9.46 because my primary bar registration is in Australia and not in any US state. "
    },
    {
      "thread_title": "Skipping PIPs And Offering Severance (As A Policy)",
      "thread_body": "Has anyone here adopted a practice of skipping the formal PIP process and moving directly to a severance offer for under-performers? Or, are any of you aware of any late-stage private tech companies who have implemented this approach (i.e. not Apple, Meta, Amazon, which follow a similar approach)? Specifically, I'd love to know:   * Are you seeing this trend in your networks, and if so, how is it working in practice?   * What pitfalls have you encountered (beyond the obvious need for solid documentation and legal review of terminations)?   * Any practical tips for managing risk or handling edge cases that aren't obvious from the outside?   Would appreciate any real-world examples or lessons learned--especially from companies that don't have the litigation budgets of the public tech giants. Thanks. "
    },
    {
      "thread_title": "Pre-Launch Contract Strategies",
      "thread_body": "I'm advising a startup that's aiming to launch its product on January 1 and we're currently exploring the best legal and strategic ways to lock in customers this fall/winter, before the product is fully live. I'd love to hear any suggestions or experiences with:   * Early access agreements or pre-sale contracts   * Letters of intent vs. binding agreements   * Deferred billing models or refundable deposits   * Legal considerations around offering discounts for early commitment   * Common pitfalls or red flags you've seen   Any frameworks, template clauses, or war stories would be hugely appreciated. "
    },
    {
      "thread_title": "Unlimited Leave/Regulatory Risk",
      "thread_body": "For those companies (in particular, those that are fully-remote): our company offers \"unlimited leave\"; so, we don't track PTO, sick days, etc. Management here does not see any performance problems based on this practice - anyone that takes advantage is dealt with on an individual basis. Our outside counsel is advocating to change this practice due to potential exposure for, what, I take it, is state labor laws. Clearly, it'd be a major cultural change to implement a new policy (and require admin support, etc.). Anyone have a position on this?  "
    },
    {
      "thread_title": "Counsel expert in FDA advisory committees",
      "thread_body": "Hey all - I'm looking for a recommendation for outside counsel who is an FDAMA expert, specifically with respect to FDA advisory committee composition and operations. Asking on behalf of a journalist who is writing a story. If anybody has a recommendation please let me know. "
    },
    {
      "thread_title": "Detection And Deterrence Of AI During Interviews",
      "thread_body": "I was hoping to get some feedback on what your organizations have implemented to detect and deter impermissible use of AI (bots) during interviews. Our HR team is looking to legal to provide a policy or agreement language that candidates must acknowledge noting AI will not be used. Our team has run into a few situations where they believe AI bots were used during interviews. In one instance, HR noticed a \"person's\" accent changed from round to round. It seems to be candidates for IT roles. "
    },
    {
      "thread_title": "Validity Of Credit Support By UK Entity In Debt Financing",
      "thread_body": "Does anyone know/have experience with taking out group debt facilities and trying to carve out a UK entity from the cross-guaranty and from the joint and several obligations of borrowers? Current discussions we're having would make a UK entity in our group a co-borrower along with other group entities  (although the reality is that the UK entity will never be the entity which borrows under the facility) and therefore jointly and severally liable for the obligations of the other borrowers. It would also provide a cross-guaranty.  However, for regulatory reasons, we need to carve the UK entity out of the cross-guaranty and make it not jointly liable for the obligations of the other group entities. The UK entity will also still grant share security and other classic debt finance security. The question we're trying to bottom out is - would a UK administrator/insolvency practitioner successfully be able to set aside/invalidate this part of the security package on the basis that the UK entity has actually not received the benefit of the loan and that therefore there was no benefit/consideration for the security being provided? "
    },
    {
      "thread_title": "Swigart - Access Request - California Residents",
      "thread_body": "Hello everyone, I am reaching out to gather your feedback and experiences regarding access requests for customer data from California residents, especially those initiated by law firms such as Swigart, under California Civil Code § 1798.83 (\"California's Shine the Light Law\"). We have recently received a formal request for access to a consumer's data and are currently evaluating the most appropriate response strategy.   * Have some of you faced a similar situation?   * If so, I would greatly appreciate if you could share with me the approach or strategy you adopted or any recommendations or important points to keep in mind and, if applicable, contact details for any law firms you would recommend for supporting such cases.   I'll be happy to discuss over a call. Thank you very much in advance. "
    },
    {
      "thread_title": "Vendor For Temp Legal Help In France",
      "thread_body": "Hey everyone! Does anyone have a recommendation for a company where I can get temporary legal help in France? We want to bring in an employment specialist qualified in France on a full time, temporary basis. Thank you! "
    },
    {
      "thread_title": "International Sales Approach",
      "thread_body": "We are a SaaS company that primarily sells in the US, Canada, UK, and EU. We have had sellers bring forward prospects from countries outside of that list, but it's been on a very ad hoc basis, so we're trying to put together a plan regarding how to best handle selling into a new country. I'm curious if anyone has experience with putting together such a plan or if anyone can share some sample documentation. "
    },
    {
      "thread_title": "Nue + Ironclad",
      "thread_body": "Are there any companies out there that use Nue? Bonus points if you also use Ironclad internally as well. I'm hoping to connect with a company that uses Nue and get some feedback on them. "
    },
    {
      "thread_title": "Counsel For Identity Theft Recovery + Standard Contingency Fees",
      "thread_body": "A colleague experienced major identity theft issues and was looking for a referral to help mitigate the damage and potentially recover some of the loss. We helped get her a recommendation through one of our outside counsels and she was quoted a contingency fee of 45% of the recovery.  My first instinct was that 45% seems extremely high but not sure if that is standard for that type of legal work.  Does anyone have any experience or recommendations in this area? I offered to check with the Braintrust to see if anyone can share if 45% contingency fee is normal or if there are any other counsels that someone could recommend. Thanks! "
    },
    {
      "thread_title": "Custom GPT For Employment",
      "thread_body": "Hi - we are a remote company with various employees in global locations. I'm looking to build or access a custom GPT for legal employment questions. Anyone done this already or aware of a public-facing version? "
    },
    {
      "thread_title": "Privacy Compliance Tools",
      "thread_body": "We're trying to onboard a privacy vendor (e.g., Ketch, Osano) to provide a full suite of privacy functionality. Outside of a web form for DSARs and a cookie banner, our engineering team has historically tried to build everything internally. We believe we've outgrown that approach, but we're facing significant pushback. For companies operating in multiple jurisdictions (US, UK, EU, Canada), 1) are you using vendor tools for broader privacy functions like data mapping, ROPA, or still building internally? 2) At what point have you decided it makes sense to move to an OTS solution? 3) How have you persuaded your engineering or other stakeholders that OTS solutions are the better approach? "
    },
    {
      "thread_title": "Recommendations For Patent Attorney To Revive Lapsed US Patents",
      "thread_body": "Hi, I am looking for recommendations for a reasonably priced patent attorney who has experience successfully reviving US patents that have lapsed due to failure to pay maintenance fees. Specifically someone who is familiar with the USPTO petition process and can effectively navigate the unintentional delay standard. This is for a small start-up who is cost sensitive (so don't want to use the large firms if at all possible) but need someone who has prior experience successfully reviving patents in similar circumstances. I would appreciate any referrals for counsel or guidance/tips if anyone has navigated this process in the past. "
    },
    {
      "thread_title": "Minnesota Attorney w/ Dept of Public Safety (State Patrol) Experience",
      "thread_body": "We are looking for a very niche lawyer who might have experience working with the Minnesota Department of Public Safety, and specifically the State Patrol. Any recommendations are greatly appreciated! "
    },
    {
      "thread_title": "United Kingdom Subsidiary",
      "thread_body": "Does anyone have a recommendation for a cost-effective firm to advise on the formation of a UK subsidiary for a private U.S. company? Any recommendations would be greatly appreciated! "
    },
    {
      "thread_title": "Code Names For Customers",
      "thread_body": "We are implementing a system of code names when referring to certain customers that require high levels of confidentiality, particularly customers in the defense, intelligence, government and critical infrastructure sectors. Does anyone have any internal policy/guidance documents about the use of code names they can share? I would also be interested in any experience implementing masking of names on systems such as Salesforce, as well as in email/verbal communications. "
    },
    {
      "thread_title": "Canadian Healthcare Counsel",
      "thread_body": "Hello, Can anyone recommend healthcare counsel in Canada who can assist with some corporate questions? We've used DLA Piper in the past, and they were fine, but we're looking for a firm that is a little smaller and more nimble. "
    },
    {
      "thread_title": "Agreement For Employee Open Source Side Project Using Company Resources",
      "thread_body": "Hi, We have an employee who would like to contribute to an open source project that is unrelated to our business, but they would like to use some of our resources to perform the work on the project. They would use their own computer but due to the nature of the work (training an AI model) they need additional GPU bandwidth. The company is agreeable to allowing this to be done as long as it is on their own time and doesn't compete with our business. Has anyone ever agreed to something like this before? Does anyone have a sample agreement covering this? "
    },
    {
      "thread_title": "Live Event Production Company in LA",
      "thread_body": "Hey gang, Paley Center is looking for a new vendor to work on our events in LA. We need them to do sound, lights, cameras, editing and technical production for live events that are recorded. They will also project manage (i.e. not just the tech production piece) for the shows, such as coordinating subvendors/rentals. We'd prefer companies with experience at the Directors Guild and Writers Guild theaters as well as the Beverly Hilton. Also, as a non-profit our budgets are not huge. "
    },
    {
      "thread_title": "Evisort",
      "thread_body": "Good morning - Has anyone implemented Evisort's CLM product since they became part of Workday. In particular, I am curious about implementation of the tool. Did you do it yourself, have Evisort/Workday do it or use a third party implementation consultant? "
    },
    {
      "thread_title": "Equity Platform for Late-Stage Startup",
      "thread_body": "Hello L Suite community - I am at a late-stage startup that currently uses Carta as their equity management platform. We feel that we're outgrowing Carta a bit as a company, and are looking for a new equity management platform. A few of our pain points include the HRIS integration with Workday and the limited ability to run custom reports. We're aware of platforms such as Shareworks and Fidelity, but would be curious if anyone that is similarly situated has recommendations on equity management platforms or any advice for someone in our situation. "
    },
    {
      "thread_title": "Puerto Rican Birth Certificate",
      "thread_body": "Hi all - I have a family member who is looking for an attorney that can provide assistance in getting a copy of her grandfather's birth certificate in Puerto Rico (probably 1890-1900). Any leads would be welcome. Thank you! "
    },
    {
      "thread_title": "AI Contract Redline Tools",
      "thread_body": "We are actively evaluating AI tools for two use cases: redline capabilities and support in building out playbooks from templates or building out standard templates via comparison. We have faced some challenges as we contract in multiple jurisdictions globally and have yet to find a tool that can support confidently. Additionally, we contract in several languages, some of which we are not native speakers. Has anyone had success with similar use cases? "
    },
    {
      "thread_title": "API Fee Models",
      "thread_body": "We are trying to solve for a potential issue where 3rd parties accessing our API may make excessive calls that impact performance of our API or systems. Beyond API agreement terms restricting usage, providing the right to limit access or termination for convenience rights that can address excessive API calls, what fee structures or models have others come across in API agreements to compensate for usage that may also deter usage at excessive levels? "
    },
    {
      "thread_title": "EdTech DPA Management",
      "thread_body": "Hello! Looking to connect with attorneys in the Edtech space that contract with K-12 school districts to discuss how your company manages DPA requests. Would greatly appreciate a couple of minutes of your time to dive into this topic. Thank you in advance!   "
    },
    {
      "thread_title": "VerifAI vs. Other AI Contract Review Tools",
      "thread_body": "Hi all, our company uses the SpotDraft CLM and I'm starting to use its integrated AI assisted review tool, VerifAI, including building out playbooks, etc. For those of you who have experience with VerifAI and other AI contract review tools, what was your experience? What tools would you recommend for contract reviews? "
    },
    {
      "thread_title": "Ironclad/Salesforce Integration Consultant Recommendations",
      "thread_body": "Hi all, I am looking for consultant recommendations for Ironclad/Salesforce integration work. We currently have the integration in place but would like to migrate some CRM work currently done in Ironclad to Salesforce to better utilize both tools & gain more data insights. What I've found so far SME only in Ironclad or in Salesforce but am hoping to find someone who speaks both platforms. Thank you! "
    },
    {
      "thread_title": "Commercial Litigator in Ontario, Canada",
      "thread_body": "Hey! We're looking for a commercial litigator practicing in Ontario to help us enforce a contract to secure a refund for defective machinery purchased from a Toronto-based supplier. Experience with the food industry/regulations would be a plus. Thanks in advance for any suggestions! "
    },
    {
      "thread_title": "CA or TX employment Attorney Recs?",
      "thread_body": "Hi all, I have two attorney recommendation requests:    1. Does anyone know of an affordable, plaintiff-side TX employment attorney? I have a friend with a misclassification case they want to pursue.   2. Does anyone have a CA employment attorney who may be interested in project-based work? A former HR colleague is standing up an HR program for a small CA business and needs a legal partner.   "
    },
    {
      "thread_title": "TermScout Certification",
      "thread_body": "Hi all, I'd really appreciate any insight on the value proposition of TermScout certification. There was a thread last year that mentioned TermScout certification, and a few people shared positive experiences, but the focus of that discussion wasn't on ROI. I'd like to dig a bit deeper into whether the certification has meaningful value.  I'm particularly interested in whether certification has helped reduce negotiation timelines, served as a differentiator with customers or procurement teams, or prompted any feedback from customers. Even if you haven't used it, I'd be interested in your perspective on how much weight, if any, you give to the certification when reviewing a vendor's standard terms. For context, we're a SaaS company (employee relations case management), and our customers run the gamut from Fortune 100s to local governments. We see a wide range in the level of legal involvement -- some customers have experienced counsel reviewing our terms, while others rely entirely on procurement with little or no legal input.  Many thanks in advance! "
    },
    {
      "thread_title": "New Health Insurance Plan Quotes And HIPAA",
      "thread_body": "I am being told by broker that after providing the standard employee census to get quotes for new health care plan for our company, we have heard back from that \"based on the initial screening (medications, pharmacies, etc.), some providers raised questions about one or more individuals. Due to medical confidentiality, they didn't provide details but requested additional information in order to properly assess and quote.\" They now want medical questionnaires filled out be employees. I have seen those questionnaires for self-funded plans before but have never seen them for fully funded plan quotes. Also I am concerned how the health insurance providers would have gotten access to any \"medications, pharmacies\" type information. Wouldn't that violate HIPAA without an employee consent for them to get RX info? This is not our current plan provider. I am wondering if the broker is giving us some wrong info. Anyone ever run into this? These are reputable plans - United and Aetna. I reviewed their privacy policies and pretty sure accessing RX info would violate them without signed consent. "
    },
    {
      "thread_title": "Deemed Export Check",
      "thread_body": "Hi people - any of you do trade / export compliance? If so, I'd love to understand your deemed export check process - in particular, at what stage in offer / hiring / onboarding you're doing a deemed export check to ensure you're not sharing proprietary technology and source code in violation of export control laws. I'm not looking for legal input, I'm looking for operational / practice fixes you've found. Happy to chat live on a Zoom. Thanks! "
    },
    {
      "thread_title": "Using AI To Translate Documents",
      "thread_body": "We acquired a German company and there are about a dozen legacy contracts that are in German. Our plan going forward is to push for agreements to be in English if possible. We don't need certified translations, just to get a basic understanding of any key concerns we should have with each contract. I was wondering if anyone has used any AI tools like Google translate to translate legal documents. Did you have concerns about the data protection and privacy, and if so, how did you address it? Thanks! "
    },
    {
      "thread_title": "Legal Training For GTM Teams",
      "thread_body": "Would love to hear what's worked (or not worked) when it comes to legal training for your GTM teams -- Sales, Customer Success, Marketing, etc. In a high-growth SaaS environment, how are you enabling teams to spot red flags early, understand deal guardrails, and know when to loop in Legal -- all without bogging down momentum? Have you tried interactive formats, embedded office hours, or role-based playbooks? I have an in-person training at the end of this month and I am looking for practical ideas that scale, stick, and actually make an impact on the front lines. "
    },
    {
      "thread_title": "AI (And Other) Acquihires",
      "thread_body": "With very large transactions we're seeing that seem to be acquihire-ish (Windsurf being the most recent) I'm curious what people are seeing for terms. Are you usually seeing significant money coming back to the cap table or is it all/almost all going to the team? I imagine we will see more of these and want to get a sense of what the market is looking like. "
    },
    {
      "thread_title": "Legal Budget For Outside Counsel Work",
      "thread_body": "Hi everyone, I'm looking to better understand how other legal departments manage budgeting for outside counsel spend, particularly for ongoing or unanticipated matters. Our finance team requires us to forecast spend for all OC vendors, and any unused budget at the end of a quarter is forfeited (i.e., it does not roll over). As a result, whenever we need to engage a new vendor or initiate a new matter mid-quarter, we're typically asked to reallocate funds from existing line items within our annual budget. Historically, this hasn't been a significant issue for us, but as our OC spend grows, it's becoming increasingly difficult to manage on an ad-hoc basis and as you know, it is impossible to anticipate all possible OC related spend ahead of time. I'm curious how others navigate this challenge. How do you plan for unpredictable legal spend? Do you build in contingency buffers, establish separate discretionary pools, or engage finance differently to accommodate real-time needs? "
    },
    {
      "thread_title": "Contract Migration and Metadata Update Vendor",
      "thread_body": "Hi everyone, I am looking for a vendor to help with contract and data migration of our contracts, including updating key provisions and metadata to our new CLM, Ironclad. Does anyone have any recommendations of vendors they have used and liked? "
    },
    {
      "thread_title": "Legal Documents Translations",
      "thread_body": "Can anyone please share the recommendations for the translation providers that you used to translate documents like Terms of Service, Privacy Notice, etc., to the listed languages? "
    },
    {
      "thread_title": "NY In-House Counsel Registration Question",
      "thread_body": "Asking for either guidance or NY counsel who can assist with the below questions for a colleague:  NY requires in-house counsel registration for \"full-time and part-time attorneys employed in New York State (including those who reside outside of New York State) as in-house counsel register as in-house counsel if they are providing legal services to their employers.\" See here.  In today's remote environment, many roles are hired remotely and attorneys perform their work exclusively from their home state, where they are licensed. Income tax is generally withheld in the state in which the attorney is employed. However, they are providing legal services to their New York-based employers. In these instances, is the attorney considered \"employed in New York State\" for purposes of registration? Is it better to apply for registration out of an abundance of caution, given the ambiguity? If determining to apply past the deadline, what might one want to include in their \"Letter of Good Cause\" for applying past the deadline. Is the above stated ambiguity enough? "
    },
    {
      "thread_title": "Hiring AI Engineering Talent in China",
      "thread_body": "Given the AI talent frenzy, we have portfolio companies who are considering hiring engineering talent in China to help with model training and other engineering projects. Understand there are a lot of data privacy, export rules, IP, and other regulations that they'll need to be mindful of, but wondering if (1) anyone has experience with hiring AI engineering talent there, (2) any suggestions on US or PRC counsel who has been helpful in developing a scope of work and guidelines on information sharing to appropriately manage regulatory/privacy/IP issues; and (3) if there are any recommended PEOs or agencies that are helpful to employ a small team instead of forming a company in PRC. "
    },
    {
      "thread_title": "Part-Time patent Portfolio Paralegal",
      "thread_body": "Any recommendations appreciated for an IP / patent paralegal service or independent contractor/consultant for part-time support of a patent portfolio (need someone familiar with managing a patent docket and international patent offices assignments/powers-of-attorney issues). I'm spending too much of my own time chasing down paperwork, or ignoring it for too long and then paying law firm rack rates to get things done. "
    },
    {
      "thread_title": "Legal In-House Team Leveling Framework (for Compenstaion)",
      "thread_body": "My Finance Exec is asking for a Leveling Framework for Legal Team hires that shows levels, core competencies, and salary bands. Anyone have some examples or a place to start? "
    },
    {
      "thread_title": "Stock Options Valuation For US Citizens/Tax Residents Based In The UK",
      "thread_body": "Morning, I'm looking for advice from anyone who has experience on US-UK stock options regimes, specifically around the valuation that has to be used for issuing to US citizens and US tax residents who are based in the UK. Our stock options are issued by our US Delaware topco but most of our employees are in the UK and we've set up a UK EMI sub-plan which we're about to start issuing from. The exercise price of the UK EMI is nominal value (i.e. $0.0001) as is pretty normal and is therefore quite a lot more preferential for employees than our 409A valuation.       Our counsel have told us that any US citizens or US tax residents would be barred from receiving options under the EMI scheme at the EMI nominal exercise price and that we would have to issue to them at the 409A (we're talking about a few individuals who've been based in the UK for a while and one who is moving to the UK for long term). This seems a crazy outcome to not allow them to benefit from the EMI price - so am looking to see if anyone can corroborate this / has experience with practical alternatives that don't penalise the employees. If the answer is we have to issue at the 409A then OK but I am trying to achieve a better outcome for these individuals if possible! "
    },
    {
      "thread_title": "AI Agents For E-Billing And Contracting",
      "thread_body": "Hello, Is anyone here experimenting with AI agents for eBilling or contracting workflows? We're currently exploring how AI agents might serve as an overlay on top of our existing systems -- rather than going all-in on a full eBilling or CLM platform. Would love to hear if others are taking a similar approach or have insights to share. "
    },
    {
      "thread_title": "AI Councils/ Committees: Who's At The Table And Is It Working?",
      "thread_body": "As many of us are navigating the governance of AI for the first time-- whether through formal councils/ cross-functional working groups, I'd love to gather some credible data for all to share. Please share below what is/ is not working for you so we can enable businesses to stay competitive with AI while enabling reasonable compliance and the agility that many businesses crave.       Who is currently leading your company's AI council / committee / working group?   (Choose the role with day-to-day ownership or chairing responsibility.) 🔘 Legal / General Counsel   🔘 CTO / Engineering   🔘 CPO / Product   🔘 CPO / HR or PPL   🔘 Other (Specify below) Who are the core stakeholders on the council (e.g., Legal, Risk, Compliance, Privacy, Product, Security, Comms, PPL, etc)?      Do you think your current setup is working well? Why/ why not?       If you'd change the composition or leadership of the group-- what would you do differently?      Any other tips/ reasons why you would vouch for a certain structure and why the Ai council should be propped up in the first place?       I'd love to compare the notes and see what's working across industries (especially for companies subject to the EU AI Act). Thanks everyone! "
    },
    {
      "thread_title": "UAE Corporate Counsel",
      "thread_body": "Can anyone recommend a great UAE lawyer for some basic corporate work (e.g. setting up a subsidiary, etc.)? Thank you in advance - I've gotten some amazing recommendations on this platform! "
    },
    {
      "thread_title": "Legal Ops (Legal Operations personnel)",
      "thread_body": "I have heard that many technology startups (including mine) are now opening positions for a Legal Ops person. Has anyone hired for this role and would be willing to share what they do, how they add value, who they report to, how it's different from other legal roles such as paralegal or EA, what's their compensation structure, etc., do they have a legal background?      What is the typical background for a legal ops person? Did you hire someone with a CS background? Were they a Jack of All Trades?  Any insight into this would be much appreciated. Thank you! "
    },
    {
      "thread_title": "Experience with EasyStaff as PEO / EOR?",
      "thread_body": "We're considering engaging EasyStaff to assist with engaging contractors / freelancers in jurisdictions that are not supported by larger PEO/EOR providers. If you have experience with this company, I'd be very interested in connecting. "
    },
    {
      "thread_title": "How To See Who Has Settled With A Patent Troll?",
      "thread_body": "Hi all, we're dealing with an IP troll and I'm curious to see how I can find out which other companies have settled with them. Would prefer to save on the outside counsel fees and look ourselves rather than ask them. Thank you! "
    },
    {
      "thread_title": "Token Incentive Plan",
      "thread_body": "Hi all, does anyone have experience establishing a Token Incentive Plan for your organization and establishing appropriate benchmarks for team members? Not finding much market insight on something like this. "
    },
    {
      "thread_title": "eBay Vero Program",
      "thread_body": "Hi, does anyone have experience with the eBay Vero program, which is their way of accepting takedown notices for infringing products? I have been getting the runaround from them for weeks and I'm wondering if I am approaching this the wrong way.  Would love to talk to anyone who has experience getting them to take something down. Thanks! "
    },
    {
      "thread_title": "Annual Bonus Prorations for Leaves of Absence",
      "thread_body": "We are rolling out an annual bonus program, which is based on company performance and individual performance. 1\\. We want to consider prorating the amount payable to employees to exclude leaves of absence. Is this a common practice or does this raise compliance issues? Our authorized leaves of absences are parental, bereavement and medical.  Additionally, our Finance team is exploring a model where the bonus is tied to base pay, which means those who go on a paid leave of absence (e.g. maternity) would get more then those who go on an unpaid leave of absence (e.g. medical).      Curious to know if any here have explored the questions above and what you came up with? "
    },
    {
      "thread_title": "Compensation Data Providers for VCs",
      "thread_body": "We're in the process of reviewing and updating our internal compensation structures and are looking for a reliable compensation data provider to support this work. If you've worked with a firm or platform that provides robust benchmarking data across roles, levels, geographies for venture capital firms (including salary, bonuses, carry for AUM/industry) --I'd be grateful for any recommendations. Appreciate any suggestions or experiences you're willing to share! "
    },
    {
      "thread_title": "Vendor for Form SLT",
      "thread_body": "We're lucky to have been tagged with completing and filing Form SLT with the Treasury Department every month. It's not a huge lift but we'd like to focus our compliance resources elsewhere. Has anyone found a vendor to help them with this monthly filing? We've asked our compliance consultant and they don't do it. "
    },
    {
      "thread_title": "Experience With Boost LLC for Government Contracting",
      "thread_body": "Hello All - I'm curious if anyone has experience working with the legal service provider BOOST, LLC for Government contracting work? Would appreciate any type of feedback or customer reference on your experience with them. Thanks. "
    },
    {
      "thread_title": "Ad‑Tech Privacy Counsel",
      "thread_body": "A former colleague's CA-based ad network is moving to a \"code‑on‑page\" first‑party data model. They are looking for cost‑effective outside counsel (firm or solo) with strong ad‑tech/programmatic experience to update their privacy policy and advise on new data-handling process/playbooks. Grateful for any recos - many thanks! "
    },
    {
      "thread_title": "Seeking Personal Injury Lawyer In Washington State",
      "thread_body": "Braintrust: A friend of the family was in a car accident in Seattle and is looking for someone to represent her. Would love a recommendation. "
    },
    {
      "thread_title": "Local Counsel in Brazil and Chile (SaaS, Privacy, Corporate)",
      "thread_body": "Hi - would appreciate recommendations for local counsel in Brazil and Chile, respectively, with the following specs:   * General corporate practice, familiar with SaaS models including sales and related tax matters   * Must have data privacy expertise   * Familiar advising US tech companies, late stage private company type work   * Expertise dealing with government contracting / public bid process (esp in education sector) is a bonus.   I have looked in the archive but finding it difficult to identify firms recommended more than once, other than Pinheiro Neto in Brazil and Baker Mckenzie in Chile.    Not looking for a single solution for both countries. "
    },
    {
      "thread_title": "Stripe Contact",
      "thread_body": "Hi All - Our team has run into some issues that we need real person assistance on from Stripe and have had zero success in making contact with the right team members or getting response. I am hoping someone in this network has a legal contact that they can connect me with that might help us navigate to the correct departments at the company and hopefully resolve our issue quickly. Thank you for your help! "
    },
    {
      "thread_title": "Anyone Sell Their \"Remnant Assets\"?",
      "thread_body": "We've gotten offers to buy our \"remnant assets\" (i.e. non-operating, dormant, or forgotten rights to payment--like unclaimed funds, class action claims, royalties, old IP addresses, and similar assets not used in our core business.) Basically the offer is an upfront payment plus a royalty with a cap. Has anyone done this and have thoughts/opinions? "
    },
    {
      "thread_title": "Outsourced Info Security \"Qualified Individual\" For FTC Safeguards Rule",
      "thread_body": "Hi, I'm wondering if anyone else has hired a third party to act as the Qualified Individual for purposes of compliance with the FTC Safeguards Rule (and generally to manage their infosec program) and if so if you have any advice/recs on third parties. Thank you! "
    },
    {
      "thread_title": "Hiring For Corporate Secretariat Support?",
      "thread_body": "Curious to hear people's thoughts on hiring for support when acting as corporate secretary. I've found that it's tough to find attorneys who are excited about corporate secretary/board work. I'm thinking of hiring a senior paralegal instead, to help with board agendas, minutes, resolutions & corporate documents, etc. Any experience you can share would be helpful.  "
    },
    {
      "thread_title": "Throndset Michenfelder LLC",
      "thread_body": "If anyone has experience with the Minnesota firm of Throndset Michenfelder, I'd be interested to connect for intel. A google search indicates that they specialize in ADA accessibility and personal injury matters. Thank you! "
    },
    {
      "thread_title": "What Is The Size Of Your Legal Department vs. Company (Employee) Size?",
      "thread_body": "Are there any rules of thumb for the size of the legal team compared to the employee base? Is it 1:100?  1:1000?  Thanks!  "
    },
    {
      "thread_title": "OneTrust - Jira Integration",
      "thread_body": "Does anyone have experience with making workflows in Onetrust for DSARs? I am attempting to create an integration to Jira so that our backend team automatically is notified of what data we need to delete but I cannot figure it out! The help resources on Jira also arent incredibly helpful. Any insight would be appreciated! "
    },
    {
      "thread_title": "Canada Nexus Issues / Hiring Employee through PEO",
      "thread_body": "Hi, Braintrust, Our workforce is entirely US-based, but we are contemplating our first Canadian (Ontario) hire for a rock-star individual that our team is very excited about. We are contemplating hiring this person either as an independent contractor, but--preferably--as an employee through a PEO structure.  We don't currently have nexus in Canada for any federal/provincial/local tax implications there, and our CFO is concerned that this hire might trigger nexus.      I'd be grateful to hear from anyone who's worked through this issue and has some insights to share. Thanks in advance! "
    },
    {
      "thread_title": "Age Verification Vendors",
      "thread_body": "Hi all, with various age verification requirements coming into place for online platforms, I am curious what methods (biometric/credit/government ID?) & vendors your companies are using (or planning to use) in order to perform that verification? Thank you! "
    },
    {
      "thread_title": "Seeking Insights On Implementing Data Retention Policies",
      "thread_body": "Hi everyone, I'm reaching out to see if anyone has experience leading or project managing the rollout of data retention policies within their organization. I'm particularly interested in hearing about your approach--what worked well, what challenges you encountered, and how you addressed them.      Our workflows are deeply integrated across platforms like Slack, Atlassian, Google Workspace, and others, so we're anticipating a broad impact. I'd also love to connect with anyone who has considered the implications of AI tools on data and records retention, specifically around governance, auditability, and lifecycle management. If you're open to sharing policy examples, frameworks, or templates, that would be incredibly helpful. Otherwise, I'd greatly appreciate the opportunity to have an open discussion with this group and learn from your insights. "
    },
    {
      "thread_title": "Interim Counsel In Australia",
      "thread_body": "We have just entered into an agreement to acquire a company based in Sydney, Australia. During the 3-4 months between now and completion, I'd like to look into retaining a contract/interim local counsel to work with the target as soon as the deal completes, so that I can get \"lay of the land\". Our law firm would be happy to help with this, but I have a strong preference for a lawyer with in-house sensibilites. I understand Axiom does business in Australia and would welcome feedback on Axiom there and recommendations for any other interim legal staffing firms that the braintrust has had experience with. Thanks! "
    },
    {
      "thread_title": "CA Based Employment Lawyer - Employee Side",
      "thread_body": "The spouse of someone on our team is looking for review/guidance on a severance letter. He was recently laid off and needs a cost effective small shop/solo att'y in CA. I searched the database and didn't find any recent rec's. Who do you know and would recommend? Thanks in advance. "
    },
    {
      "thread_title": "False Advertising / Unfair Comp Litigator (Arizona Pref)",
      "thread_body": "Hi folks! A competitor of ours just published a LinkedIn post using our name and misrepresenting our product offers. Do you have a recommendation for a reasonably priced attorney who is well-versed in the Lanham Act, preferably located in Arizona, otherwise the West Coast? "
    },
    {
      "thread_title": "Leveraging Any AI Tech On Top Of Auditboard",
      "thread_body": "Hello, My compliance team is looking for ways to leverage AI with our Auditboard platform to help automate the management of content within the platform and/or use AI to auto respond to inquiries related to any of the documentation published in Auditboard. Has anyone looked into these types of use cases with AI and auditboard? If yes, what steps have you taken to put together these use cases? Let me know if you have any follow up questions. Thanks! "
    },
    {
      "thread_title": "Gov't Contracts Attorney Versed In Litigation",
      "thread_body": "Hi, has anyone worked with a talented attorney who addresses litigation in the government contracting space - in particular looking for someone whose been involved where a prime contract causes a constructive termination of the subK/issues around Suspension of Work clause, DFAR 52.242-14. "
    },
    {
      "thread_title": "Contingent Recruiters Focused On Startup Technical Leadership (e.g., CTO, VP Of Eng)",
      "thread_body": "I'm looking for contingent search firms that have a strong track record placing senior technical leaders (CTO, VP/Head of Engineering) in early-stage or high-growth startups. Thank you in advance! "
    },
    {
      "thread_title": "Fund Subpoena Over Founder Divorce Proceedings",
      "thread_body": "We may be receiving a subpoena for information in a founder's divorce proceedings. The requests we expect are quite broad.  Has anyone dealt with this / know the best way to handle? Would appreciate any advice. "
    },
    {
      "thread_title": "Prompting For Legal Professionals - Training",
      "thread_body": "We have a global legal team offsite in a couple months, and I would love to bring in someone to do prompting training specific for Legal Professionals. We have a wide range of comfort/familiarity with GenAI on our team and I think this would be a great way to bring everyone up to the same level. Has anyone done anything similar for their team? Do you know any trainers that would be good for this? Preferably someone that can be in person but can do remote if necessary. Thank you! "
    },
    {
      "thread_title": "Legal Startup Theo AI Seeks Retail GCs As Advisors",
      "thread_body": "I just fished a call with Jessie Gatchalian, the founder of Theo AI, a new AI tool built to predict litigation outcomes. I spoke to Jessie from the perspective of a former head of litigation about how banks and insurance companies might use such a tool.   I mentioned that I was a member of the Tech GC community and Jessie asked if there are any retail-focused GC members who might want to serve in an advisory capacity to Theo.Ai, and thus this post.   I have found that serving as an advisor to startups is a great way to network and see new technology. And if you meet them before they hire their first GC they might reach out. Please contact Jessie directly if you are interested. "
    },
    {
      "thread_title": "Recommendation For Labor Counsel For Union Organizing Response Strategy",
      "thread_body": "I'd appreciate recommendations for creative and aggressive labor law counsel to help develop and implement a national strategy to respond to union organizing efforts (bonus points if such counsel has also advised Uber, Doordash, Amazon, or Instacart). "
    },
    {
      "thread_title": "Wisconsin Civil Defense Attorney",
      "thread_body": "Hi everyone! Looking for a A Wisconsin-based civil defense attorney with experience in personal injury and (potentially) knowledge in Department of Natural Resources citations. Would appreciate any connection. "
    },
    {
      "thread_title": "The State Of AI in Business Communications",
      "thread_body": "AI Notetakers and Communications was one of the topics discussed at the Sonoma Offsite last week. There was a lot of debate on the topic, so I wanted to share this benchmarking report on The State of AI in Business Communications. Enjoy!  Meeting & Communication AI Trends:   AI meeting assistants are going mainstream: Top features in demand include:   CRM integration (49%)   Real-time transcription (47%)   Automated call summaries (44%)   Voice-to-text & sentiment analysis (36-40%)   Voice analysis is hot: 81% plan to invest in AI for analyzing voice data within 12 months. Half already have clear strategies in place.   Executives are driving adoption: C-level execs are the most active users and champions of AI meeting tech (91% are leading voice AI adoption).   High ROI use cases: Voice data tools are linked to faster resolutions, fewer complaints, increased upsell opportunities, and lower agent burnout.   But… Security is a concern:   72% expect AI-generated fraud (e.g. deepfake voices) in the next year.   Yet, 31% of companies still haven't implemented fraud prevention tools.   Smaller orgs especially lack resources/confidence in detecting fraud.      The Bigger Picture:   97% of businesses expect to increase AI investment in the next 3-5 years.   Customer service and internal collaboration are the most common early applications.   AI is moving from automation -> augmentation--helping teams think, not just do. "
    },
    {
      "thread_title": "Phantom Equity/ Equity Pool Caps",
      "thread_body": "Does anyone have experience working with phantom equity plans? A company has a traditional equity pool as well as a phantom equity plan. They also have a cap on how many shares can be granted under equity plans. Would phantom equity typically count towards a cap if it does not confer a right to any shares? Additional facts - the equity pool cap is defined \"as the maximum number of ordinary shares granted under any incentive agreement\" and incentive agreement is defined to include the phantom equity. "
    },
    {
      "thread_title": "LATAM Expansion (SAAS)",
      "thread_body": "Hi all -- wondering if anyone here has relevant experience or lessons learned. My company is a growth-stage SaaS business (selling out of a private UK Ltd and Delaware Inc) and we're starting to explore commercial expansion into LATAM. No legal entities there yet -- we're hoping to begin by selling cross-border and scaling up only if/when the opportunity justifies. I'd love to hear from others who've done something similar, especially on:   * Best approach to contracting (Delaware vs UK paper, local language, local expectations)   * Handling WHT and tax issues (especially Brazil/Mexico/Argentina)   * How you handled local hires (contractor vs EOR vs subsidiary)   * When local incorporation made sense for you (if ever)   * Data protection / regulatory gotchas we should know about   Happy to share anything we learn in the process -- and would really appreciate any practical tips or war stories from others who've gone down this road. "
    },
    {
      "thread_title": "Immigration Lawyer for I-192 US Entry Waiver (Travel to US with Criminal Record)",
      "thread_body": "Could anyone recommend a US immigration lawyer to assist with an I-192 US Entry Waiver, in this case regarding a Canadian who needs to travel to the US who has a criminal record from a minor conviction many years ago. "
    },
    {
      "thread_title": "Recommendation for CA Surrogate Attorney",
      "thread_body": "Does anyone have recommendations for a surrogate lawyer in CA, preferably San Diego or San Francisco area? "
    },
    {
      "thread_title": "Philly Bankruptcy Lawyer?",
      "thread_body": "Anyone have a reference for someone who can support responding to a small Bankruptcy preference legal claim in Philadelphia? Thanks! "
    },
    {
      "thread_title": "UK Employment Question - IP Assignment - Deeds with Witnesses?",
      "thread_body": "A seasoned lawyer in England recommended we have all invention assignments from UK personnel as deeds that need to be signed in the presence of a witness. This is harder because people are remote. Do you handle IP assignments that way from your UK team members? As a deed with a witness requirement for all assignments of IP when you hire a new employee and have them assign ownership of inventions to the company, new one for me. "
    },
    {
      "thread_title": "83(b) Advice",
      "thread_body": "Hi! Is anyone well-versed on 83(b) election? I am helping a startup sort through this but wanted to ensure I understand all aspects. "
    },
    {
      "thread_title": "Vendor Administering Employee LinkedIn Accounts",
      "thread_body": "My sales team wants to engage with a vendor whose business model handles sales lead outreach and qualification by using our BDRs' personal LinkedIn accounts. As in the vendor will log in and have full access to each employee's LinkedIn account. There are so many issues with this. I am envisioning a dozen nightmare scenarios around employee privacy, account security, or policy violations leading to account suspension. My sales team is adamant about wanting to use them though. Has anyone else approved using a vendor who does this? If so, I would appreciate hearing your thoughts on how you got comfortable with this and about anything you put in place to protect your employees. "
    },
    {
      "thread_title": "Crisis Management Plan",
      "thread_body": "We are working on our Legal Crisis Management Plan and have some high level language on when we need to bring a crisis to the board, that is in case of crises that may have a meaningful impact on our business and financial performance and depends on materiality and nature of the crisis. We will always inform our executive leadership team. Another question that came up is about what our government/notification requirements are. That obviously depends on materiality and nature of the crisis. We say that we will comply with all requirements and reference our Cybersecurity and Incident Response Plan. I am very interested to hear what other do regarding these two specific items.       "
    },
    {
      "thread_title": "Dispute Resolution - Terms of Service",
      "thread_body": "Hi all, I'm reviewing our terms of service and considering making some updates. As part of my review, I'd be interested in hearing about what other SaaS or managed services companies have been including in their dispute resolution terms. Our current terms include 30 days of informal mediation and then AAA Commercial Arbitration Rules for U.S. customers and ICC rules for non-U.S. customers. Our non-U.S. business is primarily in Europe (and within Europe, primarily DACH and UK). Some specific questions I have are:   1. If you are including a requirement to try to resolve the dispute with informal mediation first, what is your time limit? I am considering extending the period in our terms but do like that a shorter period can encourage a faster resolution.   2. Which rules are you using? Why? Are there any that make sense to use for both U.S. and non-U.S. customers? Is there any special language that you include to modify the default rules?   I'd appreciate any input. "
    },
    {
      "thread_title": "Former In-House (now in law firm) IP Attorney",
      "thread_body": "Hi all, looking for recommendations for a formerly in-house IP attorney (preferably from a large pharma company) who is now at a law firm who specializes in drug development IP protection. Thanks in advance. "
    },
    {
      "thread_title": "When Did You Bring In-House Immigration Counsel VS. Using Outside Immigration Firms?",
      "thread_body": "We have \"healthy\" budget for immigration spend due to a large engineering population. I am wondering when it makes sense to hire in-house immigration counsel as opposed to continuing to rely on outside counsel? If you could share your thoughts on budgeting, hires, areas of coverage, and stage/maturity of your company, I would appreciate it. Thanks! "
    },
    {
      "thread_title": "iManage Security Policy Manager: Worth it?",
      "thread_body": "Our multi-disciplinary team has iManage Work 10 (cloud). We need to share documents within and across practice areas or with multiple individuals. We're evaluating iManage's Security Policy Manager. The ROI compared to Work 10's basic security capability isn't immediately clear. If your team's using SPM, what's easier/better and is it worth the license and implementation costs? Thanks! "
    },
    {
      "thread_title": "Navigating DORA Compliance",
      "thread_body": "I'd like to learn how non-critical SaaS providers have managed EU-based customer requests for DORA compliance - I see a few discussions on this topic from fall 2024 - early 2025, but am hoping for refreshed feedback based on the last 8 months since effective date.  Specifically:   * if you've added a DORA FAQ and Addendum on your legal center, have your customers been accepting that or pushing their addendums anyway?   * have you seen wide range in customer DORA addendums  -  I received a 5 pager and a 50 pager last week alone   * How have you navigated decoupling these addendums from pending renewals/expansion opportunities.   Thanks in advance! "
    },
    {
      "thread_title": "Transferring of IP to Ireland for Tax Purposes",
      "thread_body": "Hey braintrust, I'd love to speak with anyone who's company has (or has considered) moving their IP to Ireland for tax purposes. Would love to learn more about the considerations and processes (as well as costs and pitfalls). Thank you so much! "
    },
    {
      "thread_title": "Japanese Immigration Law Counsel",
      "thread_body": "We are looking for immigration law counsel specifically knowledgeable about or specializing in Japanese immigration law. I'd be grateful for recommendations. "
    },
    {
      "thread_title": "Creating Own Sanctions Check Product",
      "thread_body": "Have your companies created their own internal sanctions check product rather than going with an external SaaS product? If you have, I would love to have some insight on how it's going and the development process. "
    },
    {
      "thread_title": "Part-Time Help For In-House Legal Team (Ops/Admin)",
      "thread_body": "Has anyone had any success with a staffing agency or other service for part-time (as-needed) flexible support for your legal team? I've used Fenwick FLEX successfully for attorneys but am having trouble finding a a good resource for paralegal/legal ops/legal admin level of support. We tried Mom Project but had a negative experience. Any insights or recommendations would be much appreciated! "
    },
    {
      "thread_title": "Lexion And Docusign: Lexion Sunset",
      "thread_body": "Hi- Is anyone else starting to plan out how to manage DocuSign sunsetting Lexion? "
    },
    {
      "thread_title": "Slack Enterprise Grid migration",
      "thread_body": "Would anyone be willing to chat about their experience helping business migrate from Slack Business Plus to Enterprise Grid, or otherwise overhauling Slack? I'm looking for practical insights on leveraging the full functionality of Enterprise Grid as we undertake this migration and think through channel reorganization, data retention, A/C privilege issues, and other issues. "
    },
    {
      "thread_title": "Customer AI Amendments For SaaS Products",
      "thread_body": "Hi All, We've been negotiating AI amendments with our customers for a couple years now, but more recently it has been harder to get to a reasonable point on risk-sharing and our ability to continue to improve our products with any type of data (even pure usage data). Customers want reps about how the LLM was trained (even though we use a 3rd party LLM), reps and indemnification for outputs (even though that is highly dependent on user inputs) and a real blurring of lines between what type of information we own and can use for product improvement and what the customer owns and we can't use.  I assume others are facing these same amendments. What is your strategy for getting through them? Are you accepting more risk, taking hardlines, changing internal use to comply with the most stringent restrictions? I'd love to discuss and get some ideas about how to reduce handling time for these. "
    },
    {
      "thread_title": "Document/Contract Workflows, SaaS for Legal Departments?",
      "thread_body": "I am wondering what people have used for managing their legal requests and documents: from intake/requests to workflows, to approvals, to e-signature, to document repository (single source of truth). Has anyone successfully done this with off the shelf offerings (if so which ones integrated well?) or did you end up building it in-house? How long did it take? "
    },
    {
      "thread_title": "Strategic NDAs",
      "thread_body": "Happy Monday - has anyone cracked a smooth process for processing strategic NDAs? Our process is quite manual. Any recommendations for software and/or practical guidance regarding a playbook would be greatly appreciated, thank you. "
    },
    {
      "thread_title": "DSAR and Information Request Management",
      "thread_body": "We have suddenly received a flood of DSAR and other personal information requests and are struggling to deal with all of them. We'd like to think through how to build a program so that we have a scalable way to respond in a timely manner. Has anyone gone through this process and would be willing to chat with our Privacy Program Manager? Bonus points if you have a Privacy Ops/Program Manager or other similar role that she could information share and network with on an ongoing basis. Thank you! "
    },
    {
      "thread_title": "Cloud-Based SaaS Sold Via A Reseller (No Contract Between SaaS Provider And End User)",
      "thread_body": "I am looking to speak with anyone who is or has been in-house at a cloud-based SaaS provider who sells through a reseller where there is no contractual relationship between the SaaS provider and the end user. So, the SaaS provider's MSA, DPA, etc. is between the SaaS provider and the reseller only. I have been in-house with SaaS providers for that past 10 years and, although contemplated, I have never seen a reseller arrangement work. That said, I understand that these types of relationship/arrangements do exist. I am trying to understand. (1) how these are set up from a contractual perspective.   (2) how the data privacy requirements are satisfied.   (3) how in-app product terms are flowed down.   (4) I'm sure many other issues I'm not thinking about. "
    },
    {
      "thread_title": "SpotDraft MSA",
      "thread_body": "I'm about to pull the trigger on SpotDraft. For those that use them, what concessions were you able to get against their standard terms? Any feedback would be appreciated. "
    },
    {
      "thread_title": "ISO Polish Employment Counsel",
      "thread_body": "I'm looking for highly pragmatic and reasonably affordable employment counsel to help with a worker classification question in Poland. Does anybody have a recommendation? Thank you! "
    },
    {
      "thread_title": "Streamline AI - Jira integration",
      "thread_body": "Has anyone integrated Streamline AI with Jira? If yes, would love to hear from you.         "
    },
    {
      "thread_title": "TX Employee Side Employment Lawyer",
      "thread_body": "A Texas-based friend of a friend is looking for an employment lawyer for what's been described as \"possible violation of company policy, discrimination and/or wrongful termination.\" Thanks in advance for any recs. "
    },
    {
      "thread_title": "Informed Consent",
      "thread_body": "Hi all! I am looking for an informed consent to use patient donated tissue for non-academic use - essentially using it commercially as the basis for a predictive platform. "
    },
    {
      "thread_title": "CRM (Or Similar) in Argentina",
      "thread_body": "Has anyone implemented a CRM or other commercial contract system in Argentina, where many businesses have adopted a general practice of having an offer / acceptance in separate documents in order to avoid stamp tax? Would love to chat through how you managed this if so. Thank you! "
    },
    {
      "thread_title": "AI Risk And Mitigation Summary For Board",
      "thread_body": "Has anyone presented a summary of AI risks the company is exposed to and what they are doing to mitigate those risks for the board or other internal non-legal audience? I was asked to prepare a summary for the board and I can find plenty of guidance samples, but can't find a summary of the risks that is for a non-legal audience. If someone can share an example of how you presented the risks that would be very helpful. Thanks. "
    },
    {
      "thread_title": "Post-Signature Contract Management",
      "thread_body": "Hi all - I would love to get some feedback on the tools you are using for contract management. Our main focus is post-signature (searching contracts, obligation management, exception clause reporting, etc.). We are looking at CLM vendors right now, but I'm also curious about folks that have not gone the route of a traditional big CLM tool. Thanks! "
    },
    {
      "thread_title": "Retention Periods for AI Meeting Recordings and Notetaking",
      "thread_body": "Hi everyone - Just curious as to whether your companies are moving in a direction of recording more meetings and using AI notetakers and if so, how you are managing retention periods. "
    },
    {
      "thread_title": "Competition Law Counsel in Texas",
      "thread_body": "Hi! Does anyone have a recommendation for a competition law attorney in Texas? Thank you! "
    },
    {
      "thread_title": "Plans For Expiring RSUs",
      "thread_body": "For private companies that began issuing RSUs to employees in the 2019/2020 time frame, wondering how you are considering handling the seven-year expiration in 2026/2027. Have you considered any alternatives aside from raising money or a tender offer? Appreciate hearing thoughts or having private conversations. I would think that there are going to be more and more companies considering their options in the coming 12-24 months. "
    },
    {
      "thread_title": "Technical Due Diligence Consultant",
      "thread_body": "We are pursuing a relatively small acquisition where Target's only meaningful asset is software. For several reasons primarily related to bandwidth, our product/engineering team would like to retain a technical consultant to help us with code review. I'm seeking referrals to such a consultant or firm. Thanks! "
    },
    {
      "thread_title": "Double Trigger RSUs Approaching Expiration",
      "thread_body": "Hi, curious if there are any private companies out there that started issuing double trigger RSUs to employees in the 2019-2020 timeframe and would be willing to share/chat about what options you are considering as the seven-year expiration date on those RSUs approaches. Have you considered options aside from raising money or doing a tender offer? We started issuing RSUs in 2021 and would love to hear from companies a little earlier on in the timeline. Thanks! "
    },
    {
      "thread_title": "Cap Table Consolidation using rollups.com",
      "thread_body": "Is anybody using (or considering) this product? Rollups. If so, I would be grateful for any feedback about how that has gone, both to implement and then in future transactions (financing, exit, etc.). Thanks! "
    },
    {
      "thread_title": "Compliance Screening",
      "thread_body": "We are reviewing our OFAC compliance screening vendor and have identified Sanctions.io as a highly cost-effective option. Does anyone have experience with Sanctions.io? We'd appreciate any insights on their effectiveness, ease of use, support, or any challenges encountered. "
    },
    {
      "thread_title": "Life Insurance [Q]: Any & All Help & Insight Is Welcome.",
      "thread_body": "A friend purchased life insurance through a NY-based fraternal organization 40 years ago & paid all premiums. The state-based org was acquired 20 years ago by the national fraternal organization, which is based in another state.      \\- The friend has now passed on;     \\- The estate is seeking payout of the death benefit;     \\- The national org is pleading ignorance of the policy & refusing to pay;     \\- The estate has a record of policy number, premiums paid, & communications from 1990's with the NY-based org; but      \\- The estate cannot find the original policy or a copy of it. Suggested next steps? "
    },
    {
      "thread_title": "Billing Agent Agreement",
      "thread_body": "Does anyone have a good billing agent agreement that would allow one company to collect payment on behalf of another (to consolidate billing/invoicing for a shared customer)? "
    },
    {
      "thread_title": "SaaS Sales Commissions Plan",
      "thread_body": "All - I'm looking for a template sales commissions plan. Thanks in advance! "
    },
    {
      "thread_title": "Mediator/Neutral With ABC (Assignment For The Benefit Of Creditors) Experience",
      "thread_body": "Can anyone recommend a mediator with ABC (assignment for the benefit of creditors) experience? Retired judges and similar are preferred to current ABC practitioners. Ideally this person will have California ABC, but any meaningful ABC experience would be great. Thanks in advance! "
    },
    {
      "thread_title": "AI For Software Dev",
      "thread_body": "We're working on putting together practical guidance for our Eng team around use of AI tools for software development while still protecting proprietary rights. I've been looking at the recent guidance on copyrightability/authorship and patentability/inventorship, and there are some helpful examples in there but nothing that translates easily to practical guidance. Wondering how you all are thinking about this and any concrete guidance you're giving your Eng teams. "
    },
    {
      "thread_title": "Event Location Buy-Out Agreement",
      "thread_body": "We're doing a coffee shop buy out for a conference and need a contract that details F+B minimum, payment schedule, branding opps, etc. "
    },
    {
      "thread_title": "Early Retirement Program - Template Request",
      "thread_body": "Does anyone have any experience implementing an early retirement program? I would love to chat. I would also love if anyone has any past examples or templates that they could share. Thanks. "
    },
    {
      "thread_title": "Recommendation For InfoSec Consultant",
      "thread_body": "We are looking for an Info Sec Consultant to advise us on leveling up our practices. (We're a fully remote tech start-up.) Any recommendations would be greatly appreciated. "
    },
    {
      "thread_title": "Financial Advisor For Employee Education In Equity Buyout Transaction",
      "thread_body": "I'm looking for experiences or recommendations of engaging a financial advisor that could speak generally to employees in a town-hall style about the general considerations of going through a strategic transaction and the implications of having their equity cashed out. We are going through a majority recap with a large private equity firm. A number of employees have been at the company for a number of years, and thus have significant stock and option holdings that will be cashed out.   I, along with other members of the leadership team, do not want to be providing advice or answering individuals' questions, and instead we were thinking of finding a financial advisor who could speak to and generally educate the employee base on key issues they should be thinking about. The intent is that the advisor would not be giving individualized advice but would be in an educator role. Our outside counsel and audit firm are both not interested in taking on this type of role.  Has anyone done this in the context of a change of control transaction and/or are there any recommendations of individuals or firms that would be able to assist us? "
    },
    {
      "thread_title": "Data Retention Program Consultants - Recommendations Needed",
      "thread_body": "Hi all, we're preparing to refresh our data retention program and procedures for a much needed overhaul. Does anyone have any recommendations for consultants or vendors who have been useful in helping to build out a refreshed data retention program? Bonus points if they have advised in the manufacturing space! "
    },
    {
      "thread_title": "Section 16 Filing Vendor",
      "thread_body": "We are bringing our Section 16 filings in-house and are in process of interviewing vendors. Curious to hear opinions on vendors - particularly Computershare, Toppan or Workiva. Thanks! "
    },
    {
      "thread_title": "Bankruptcy Claims Management Playbook",
      "thread_body": "Wondering if anyone have/can share their company's playbook on collecting payment, fees, and debt under SaaS/software contracts from customers that have filed for bankruptcy? "
    },
    {
      "thread_title": "Mid-size law firm for employment and corporate work (Europe)",
      "thread_body": "Hi, I'm looking for recommendations for a mid-size law firm for various pieces of corporate work and employment disputes that come up from time to time across our subs in the UK, France, Netherlands and Spain. Ideally a London headquartered law firm with offices across the EU. Thank you in advance! "
    },
    {
      "thread_title": "Form PF Amendments",
      "thread_body": "Hi Braintrust! We're getting ready to update our records to comply with the new Form PF investor classifications. I'm wondering if anyone has either (1) pushed out requested updates to Form PF classifications to your LP base or (2) spent time thinking about how you might push them out, including how you plan to collect the new data.  (We file quarterly and so have a 11/30/25 compliance date. Realize VC only platforms may not be thinking about this until later in the year if you only file annually.) "
    },
    {
      "thread_title": "Compliance Consultant for ERA",
      "thread_body": "Hi - any referrals for a compliance consultant for an ERA? I'd prefer not to work with the ACA, Optima, Iron Roads of the world as an ERA. I worked with Greylin/IQEQ in my prior life when we flipped from an ERA to an RIA but ultimately switched to Optima due to the deteriorating level of service with IQEQ. In a quick search of Braintrust, I've found referrals for Aspect Advisors, Silver Regulatory Advisors, and HighCamp. Primary projects would be helping us revamp our compliance policies, assist in reviewing marketing materials on occasion, brainstorming on the thornier issues that will inevitably come up, etc. "
    },
    {
      "thread_title": "Reselling to Pub Sec Customers",
      "thread_body": "For those in Saas companies w/resale programs. I'm curious how many of you are directing all resale to gov't customers (SLED and/or FED) through a particular partner like Immix/EC America or Carahsoft. I've seen this as an approach by a few companies but would like to better understand the potential benefits of structuring a resale program this way. "
    },
    {
      "thread_title": "Paralegal/Contract Manager",
      "thread_body": "If anyone knows of any good paralegals, contract managers, or legal support personnel looking for an in-house job please forward on over! Thanks! "
    },
    {
      "thread_title": "Delegation Of Option-Granting Authority",
      "thread_body": "We are considering delegating option-granting authority from the Board to the CEO for certain lower levels of employee grants. Our law firm has provided us with guidance on Board resolutions, but I'm curious to understand if others have done this and if so, recommendations to avoid corporate governance issues. We are a 300 person Series B company with a small Board. "
    },
    {
      "thread_title": "Bulk Comparison of PDFs for Commercial Playbook",
      "thread_body": "Does anyone know of software that can ingest multiple copies of PDFs based on the same agreement template and generate a heat map or interface to review deviations from the form?      We are building a commercial playbook and I'd like a way to systematically process past customer agreements without having to build out a cumbersome excel diligence chart.      Let me know if anyone has tools or process you've found helpful. "
    },
    {
      "thread_title": "Decision Tree for Verifying Power of Attorney",
      "thread_body": "I'm looking for a legal-team-approved decision tree that can be used by operations/CX to determine if a power of attorney (specifically over a financial acct) is valid. "
    },
    {
      "thread_title": "Benchmarking In House Counsel Comp in Shanghai (or elsewhere in China)",
      "thread_body": "Hi all, we are considering hiring a junior to mid-level attorney in Shanghai, and I'd love to hear some benchmarks for comp.  Either what you have seen/heard, or if you are willing to share, what you are paying (approximations/ballpark are fine). Feel free to post here or contact directly if you'd prefer. Any data from ~3 to ~8 years out of law school would be ideal. I'm just trying go get a very rough sense. Thanks! "
    },
    {
      "thread_title": "Seeking Healthcare And Digital Health Counsel",
      "thread_body": "I'm looking for a true partner to help navigate complicated healthcare and digital health questions. Does anyone have an amazing outside counsel that is an amazing partner for in-house legal teams? "
    },
    {
      "thread_title": "Looking For A Company To Act As DMCA Agent",
      "thread_body": "Looking for recommendations for a reliable company that can serve as a DMCA agent for a small website operator. Thanks in advance. "
    },
    {
      "thread_title": "PEO in Taiwan",
      "thread_body": "I would love recommendations on PEO companies that can help us with a small team being set up in Taiwan. Who have folks worked with for PEOs generally? Any specifically in Taiwan that worked well? "
    },
    {
      "thread_title": "Re: [External] The L Suite Digest",
      "thread_body": "Hi, Thank you for your email. I am currently out of the office, returning 8/12. If this is an urgent matter, please contact Sunny Murthy (sanmathi.murthy@bytedance.com).Ted Gizewski Head of Legal and ComplianceTel: (925) 683-5868![](https://ci3.googleusercontent.com/mail-sig/AIorK4zRdvYWt5wDpCdIxTSSuIQ6W19gb7Kne6L2yyZjNW4qu-tMBGGj81kobY8Ip1CwDWRBfHCSiW0) "
    },
    {
      "thread_title": "What Is Market - For Repayment Of Convertible Note Term Sheet Upon A Sales Event",
      "thread_body": "I am curious as to what is considered \"market\"  for a conversion  of a convertible note term sheet into cash after a sales event?  Is 1.5 to 2 times the outstanding balance within market range? "
    },
    {
      "thread_title": "Maternity Benefits",
      "thread_body": "Looking to hear from New York companies who have structured their maternity leave benefits such that the state benefits go directly to the company instead of the employee. Thanks! "
    },
    {
      "thread_title": "NIS2 Primary Registration",
      "thread_body": "Hi All, We operate as a managed service provider in several EU member states and fall under the scope of the NIS2 Directive.     We have determined our main establishment for NIS2 registration to be in Poland (local NIS2 legislation yet to be implemented…) but, as we engage with the authorities in other member states, we are encountering some \"challenging\" interpretations of the registration requirements. Some authorities are insistent that we must complete a full registration etc with them locally, irrespective of our main establishment and primary registration in Poland i.e they are not acknowledging the \"one-stop-shop\" principle intended by the Directive, and one national authority has stated that they cannot accept our primary registration because they do not have a formal bilateral \"agreement\" or \"understanding\" with the Polish authority…. I was wondering if any of your organizations faced similar issues from national authorities? If so, any insights would be really appreciated! "
    },
    {
      "thread_title": "Legal Weekly Standup",
      "thread_body": "Hi all! Long time lurker, first time poster 😇 I've recently started leading the legal operations for a team of 17 lawyers at an European tech company, who never had anyone in this role before. Lots to do and facing some skepticism, but I'm going with slow and steady small wins!      Something not major but recurrent I feel need a revamp is the Weekly Standup they have every Monday. It takes about an hour and sees every practice area go one after the other listing what they're working on that week. It's a bit dry and I'm not entirely sure people listen to each other. I feel like we could go with something more interactive, I would even suggest visuals or a quick slide, but I don't want to burden counsels with extra work either.      Any suggestions/how do your teams keep updated on each other's work?   My previous company had a much larger legal team (60) and admittedly we didn't have a standup, we did however give quick updates in our Monthly Legal Town Halls, but my CLO insists we keep a weekly meeting.      Open to feedback! "
    },
    {
      "thread_title": "Legal AI Tools",
      "thread_body": "We are currently evaluating legal AI tools (we recently demoed GC AI). We also understand Harvey and White Shoe are popular products (and seem to be priced slightly better than GC AI). Would love folks' views on the pros and cons of each tool and which is best for an in-house setting. "
    },
    {
      "thread_title": "Streamline for CLM Intake",
      "thread_body": "Has anyone implemented Streamline and integrated it with a CLM? I understand that most CLM's, like Ironclad, are cradle to grave. What is missing in CLMs such that you implemented Streamline? I am wondering if I need Streamline + CLM or would Ironclad be enough? Thanks! "
    },
    {
      "thread_title": "Texas SMS - New Registration Requirement",
      "thread_body": "For those with text marketing programs, how are you handling the new registration requirement in Texas (SB 140)?      Effective Sept. 1, 2025, Texas now treats marketing text messages the same as telemarketing calls. If you send promotional SMS/MMS to Texas residents, you may need to register with the state and post a $10,000 security bond--unless you qualify for an exemption. "
    },
    {
      "thread_title": "Ramp and Spotdraft-- Are you using both or considering using both? Read on!",
      "thread_body": "Hello Braintrust! If anyone is using or considering moving to Spotdraft for CLM and you currently or will be using Ramp for procurement/other needs, I would really appreciate hearing from you! I am working on gathering support for Spotdraft building a native integration w/ Ramp and Spotdraft is trying to understand how many other inhouse teams have this need. "
    },
    {
      "thread_title": "AWS Direct Connect To Route Traffic Around China's Great Firewall",
      "thread_body": "Technical question for anyone providing B2B SaaS in China - Has anyone used AWS Direct Connect to route Google traffic from AWS China to AWS US? My tech team is exploring this approach and would love to connect with anyone who could validate it.  Thanks! "
    },
    {
      "thread_title": "Texas SMS Registration Requirement",
      "thread_body": "For those with text marketing programs, how are you handling the new registration requirement in Texas (SB 140)?         Effective Sept. 1, 2025, Texas now treats marketing text messages the same as telemarketing calls. If you send promotional SMS/MMS to Texas residents, you may need to register with the state and post a $10,000 security bond--unless you qualify for an exemption. "
    },
    {
      "thread_title": "Scalable Remote Work Stipend Management",
      "thread_body": "We are a fully remote company with employees located throughout the US, including in states like California and Illinois. We currently utilize Joon to manage remote work stipends, but we are exploring how other in-house teams are addressing these stipend requirements at scale. Specifically, I'd appreciate insights into operationally efficient, cost-effective, and risk-based compliance approaches that you've successfully implemented. "
    },
    {
      "thread_title": "Streamline.Ai Integrated With Ironclad",
      "thread_body": "We are considering Streamline.ai for our matter management. If anyone is using Streamline.ai with Ironclad, I would appreciate a quick discussion to hear how you like it and what concerns we should have as we consider this. "
    },
    {
      "thread_title": "WeChat/RedNote use in China",
      "thread_body": "Has anyone vetted China-only use of WeChat and/or RedNote, or taken initial steps to consider doing so? Would love to connect if so. "
    },
    {
      "thread_title": "Experience with CA employment counsel Sarah Goldstein, Peter Woo, or Keith Fink?",
      "thread_body": "Hello - Seeking input on the following employment firms/attorneys in California for an employment litigation matter. Would appreciate hearing from anyone who has worked with these attorneys on your experience: Sarah Goldstein (O'Hagan Meyer); Peter Woo (Jackson Lewis); Keith Fink (boutique firm Keith Fink and Associates). Thank you. "
    },
    {
      "thread_title": "Quebec Bill 96",
      "thread_body": "Hi Everyone! I wanted to reach out to see if anyone has experience with Quebec Bill 96, especially regarding advertising online and selling via ecommerce in Quebec. Curious how you addressed the French language requirements relating to advertising and your website. Compliance seems pretty straight forward (but also technically challenging as these rules only apply to one geographic area in a larger market), but did anyone end up hiring local counsel to help with compliance? If so, could you share referrals? "
    },
    {
      "thread_title": "Reasonable VC Due Diligence Fees",
      "thread_body": "Looking for directional guidance/resources re: \"reasonable\" investor due diligence fees (legal, tech, accounting, etc.) by investment size. For example (making up numbers), is $100K for a Series A $10M investment reasonable? $500K for $50M Series B? Any help much appreciated. "
    },
    {
      "thread_title": "Pre-Signed Revenue Documents",
      "thread_body": "Hello! Our leadership team is exploring ways to streamline the signature process for sales documents, especially standardized and low-risk order forms. From a legal perspective, we have some concerns -- particularly around the use of customer-preferred e-signature platforms, which could introduce risks such as untracked changes to terms or document metadata. I'm curious how other companies have approached this. Have you implemented a more efficient process for signing these types of documents? If so, how have you balanced speed and automation with the need to mitigate legal and compliance risks? I'd appreciate hearing examples or best practices -- especially approaches that have maintained control over contract integrity while enabling a smoother buyer experience. "
    },
    {
      "thread_title": "Non-Competes with Independent Contractors",
      "thread_body": "Anyone have experience or a PoV on having a traditional non-compete in your company's agreement w/ an independent contractor?  Particularly interested to hear from folks in-house that have deep employment and labor experience, or where employment and HR rolls up under them. We have a set of Independent Contractors that, if they provided the same service to a competitor, would be very detrimental.  And, this is a negotiated point.  Perhaps a euphemism, but I would describe the relationship as \"exclusive\" as opposed to \"subject to a non-compete. Assume:   * independent contractor and industry is super-specific & niche   * \"exclusivity\" would be for the term of the engagement and for a \"reasonable\" time afterwards (say like a year).   * Exclusivity (non-compete) would be geographically limited in scope.   Ignore:   * CA, ND, OK and MN - I don't think this flies in those states b/c of their sweeping and broad rules that prohibit non-competes, and specific call-outs to \"independent contractors\"   * The 2024 FTC ban (or, assume the FTC stands down next month on their current appeal as many signs point to that happening).   Bonus points for form language that has been vetted by an SME. "
    },
    {
      "thread_title": "Biotech - Non-Binding Term Sheet",
      "thread_body": "Greetings, I'd appreciate a sample non-binding term sheet for a WW exclusive therapeutics license from a US research university. Please feel free to DM. Thanks! "
    },
    {
      "thread_title": "How Are You Reporting Key Team Updates To Your GC?",
      "thread_body": "In our legal department, we're split into 7 teams. We have weekly team leads meetings to flag anything relevant across teams, and then each lead also has regular 1:1s with the GC to go deeper on team-specific blockers or critical matters. That said, we're realizing these syncs just aren't enough time to cover everything the GC wants (or needs) visibility into. There's a lot happening across teams, and not all of it fits neatly into a weekly meeting or 1:1. On top of that, it's unrealistic to expect the GC to stay on top of every Jira task or dig through various team-level reports. We want to find a smarter, more consistent way to report what the GC should know - without creating more manual work for lawyers or overloading the GC with too much detail. We track most work in Jira, so I'm thinking of an automated weekly summary (\"newsletter\") based on tagged issues, status changes, and comments. But we also have projects tracked in Sheets, Docs, etc., so it's not all in one place. Has anyone found a good system or workflow to regularly surface the most important team updates to your GC - especially across tools and teams - in a way that's low-effort but high-signal? Would love any ideas or lessons learned. "
    },
    {
      "thread_title": "GC For Public Digital Asset Treasury Company",
      "thread_body": "A good friend of mine has just started as the CFO of a small, Nasdaq-listed digital asset treasury company, and they are looking for a GC. The top priority for a candidate is public-company experience and SEC filings. Experience with crypto or blockchain is preferred, but not a must. If you're interested, send me a DM and I can provide more info on the role and an intro! "
    },
    {
      "thread_title": "Privacy Managed Service Providers",
      "thread_body": "I am looking for a privacy managed service provider that can work with us to select the right privacy software, implement and manage that partner going forward. I believe One Trust for example has a number of certified resellers that offer this service (e.g. Red Clover, Deloitte). If you have any experience or recommendations please share. By way of example, here is the link to One Trust partners. Thanks in advance for your help. "
    },
    {
      "thread_title": "UAE Cryptocurrency Counsel",
      "thread_body": "Hello brain trust! Would love recommendations for UAE counsel to advise on cryptocurrency regulatory compliance. Thanks in advance! "
    },
    {
      "thread_title": "Personal Vehicle Use Policy/Due Diligence",
      "thread_body": "Hi, I'm looking for a personal vehicle use policy and best practices for the types of checks we should be doing before allowing someone to use their personal vehicle for work (i.e. license checks, proof of insurance, etc). For context, Clipboard is an entirely remote company. Some team members use their personal vehicles to visit customers. Without creating too much red tape, I would love thoughts on what due diligence we should be doing on team members who drive, and what if any representations we should be securing from employees that their vehicles are in good working order. Thank you all! "
    },
    {
      "thread_title": "Fund Obligation Tracking Software",
      "thread_body": "We are looking for software to help us track and manage obligations across LPAs, Operating Agreements, Side Letters, and similar documents. Ideally, we want a platform that can help us stay on top of things like disclosure obligations, financial reporting deadlines, LPAC approvals, side letter compliance, etc. We're currently demo'ing Ontra, so I'd be especially interested in hearing from anyone with experience using it. But I'd also love to hear what other platforms people are using (or have tried) and any pros/cons you've seen. "
    },
    {
      "thread_title": "Distribution of assets from subsidiary to parent",
      "thread_body": "Looking for a template dissolving a wholly-owned subsidiary and distributing the assets up to the parent company (all Delaware entities) "
    },
    {
      "thread_title": "Time Zone Management",
      "thread_body": "I work primarily with international teams where key individuals travel a lot, and I'd love to find a way for the team to know who will be where when without going through the hassle of sending invites and clogging everyone's calendars.  Goal is to encourage people to coordinate their own travels to meet F2F.  We've had a look at the new Microsoft app \"Places\" but it didn't seem that intuitive.  How are you tracking this? "
    },
    {
      "thread_title": "Telephone Solicitation Registration Statement",
      "thread_body": "Hi All, Has anyone filled out the Texas Telephone Solicitation Registration Statement (Form 3401)? There's a lot information and I just want to make sure I'm not missing something or overthinking this. "
    },
    {
      "thread_title": "Direct Legal To Legal For Sales Redlines?",
      "thread_body": "We've had a couple of issues where (particularly with larger customers using their paper) the opposing party has said that our first round of redlines are completely unacceptable and insulting and they're looking at another vendor as a result. Of course, the redlines aren't -- we're just trying to make customer paper work for our business and product, which requires a lot of changes. I think part of the problem is that our sales team is passing the redlines along and perhaps not doing the best job managing the process. Does anyone go legal to legal direct on larger deals to negotiate the contract? "
    },
    {
      "thread_title": "ISO / NIST / CMMC compliant BYOD or International Travel Policies",
      "thread_body": "Hi, Any companies who are (or are trying to become) ISO / NIST / CMMC compliant who can share policies on Bring Your Own Devices (BYOD) or international travel? "
    },
    {
      "thread_title": "Divorce Attorney (Northern California, Sacramento - Grass Valley)",
      "thread_body": "I'd appreciate any recommendations for a divorce attorney or mediator in the Sacramento to Grass Valley corridor (including Colfax, Auburn, Roseville). Assets are modest, but expect there may be custody issues. Many thanks. "
    }
  ],
  "metadata": {
    "total_unique_threads": 480,
    "duplicates_removed": 20
  }
}